{
    "_meta": {
        "sources": [
            {
                "json": "Ishiir",
                "abbreviation": "Ishiir",
                "full": "Ishiir",
                "url": "https://regateiro.pt/5etools/homebrew/ishiir-feats.json",
                "authors": [
                    "Sieg"
                ],
                "convertedBy": [
                    "Morb"
                ]
            }
        ]
    },
    "feat": [
        {
            "name": "Acrobat",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "dex": 1
                }
            ],
            "entries": [
                "You become more nimble, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Acrobatics} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "As a bonus action, you can make a DC 15 Dexterity ({@skill Acrobatics}) check. If you succeed, {@quickref difficult terrain||3} doesn't cost you extra movement until the end of the current turn."
                    ]
                }
            ]
        },
        {
            "name": "Actor",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "cha": 1
                }
            ],
            "entries": [
                "Skilled at mimicry and dramatics, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on Charisma ({@skill Deception}) and Charisma ({@skill Performance}) checks when trying to pass yourself off as a different person.",
                        "You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Wisdom ({@skill Insight}) check contested by your Charisma ({@skill Deception}) check allows a listener to determine that the effect is faked."
                    ]
                }
            ]
        },
        {
            "name": "Alchemist",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "int": 1
                }
            ],
            "toolProficiencies": [
                {
                    "alchemist's supplies": true
                }
            ],
            "entries": [
                "You have studied the secrets of alchemy and are an expert in its practice, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with {@item alchemist's supplies|Ishiir}. If you are already proficient with them, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with them.",
                        "As an action, you can identify one potion within 5 feet of you, as if you had tasted it. You must see the liquid for this benefit to work.",
                        "Over the course of any {@variantrule Short Rest|Ishiir}, you can temporarily improve the potency of one non-masterwork potion of any rarity. To use this benefit, you must have {@item alchemist's supplies|Ishiir} with you, and the potion must be within reach. You must expend gold equal to a quarter of the potion's value. For the next 24 hours, the potion gains the masterwork property. If it hasn't been used within that time, it reverts to its previous form."
                    ]
                }
            ]
        },
        {
            "name": "Alert",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "Always on the lookout for danger, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain a +5 bonus to initiative.",
                        "You can't be surprised while you are conscious.",
                        "Other creatures don't gain {@variantrule Advantage|Ishiir} on {@variantrule Attack Roll|Ishiir}s against you as a result of being unseen by you."
                    ]
                }
            ]
        },
        {
            "name": "Ambassador",
            "page": 1,
            "source": "Ishiir",
            "skillProficiencies": [
                {
                    "persuasion": true
                }
            ],
            "languageProficiencies": [
                {
                    "any": 3
                }
            ],
            "entries": [
                "What can you say? You're a people person.",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Persuasion} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You learn three languages of choice.",
                        "You have a natural knack for understanding protocol and manners even in unfamiliar situations in cultures that are not known to you. The DM will inform you before you commit an unwitting faux pas or unknowingly give insult, and will advise you on the best way to behave in any situation where decorum counts."
                    ]
                }
            ]
        },
        {
            "name": "Ancient Blood",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "draaken"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "The damage of your Breath Weapon racial feature increases by {@dice 1d6} ({@dice 5d6}). The damage increment doubles at the levels 6 ({@dice 7d6}), 11 ({@dice 9d6}), and 16 ({@dice 11d6}).",
                        "Additionally, your breath weapon increases in size as you grow stronger. For each point of {@variantrule Proficiency|Ishiir} above 2 your breath weapon grows by 10 feet if it is a line and by 5 feet if it is a cone.",
                        "Further, you gain additional features related to your Breath Weapon based on your Draconic Ancestry:",
                        {
                            "type": "list",
                            "items": [
                                {
                                    "type": "list",
                                    "style": "list-hang-notitle",
                                    "items": [
                                        {
                                            "type": "item",
                                            "name": "Black",
                                            "entries": [
                                                "Every creature that failed its {@variantrule Saving Throw|Ishiir} against your breath weapon also takes acid damage equal to double your {@variantrule Proficiency|Ishiir} at the beginning of each of its turns for 1 minute and its AC is reduced by 2. An affected creature can make a CON save at the end of each of its turns to end this effect."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Blue",
                                            "entries": [
                                                "Every creature that failed its {@variantrule Saving Throw|Ishiir} against your breath weapon is also {@condition Dazed|Ishiir} for 1 minute. An affected creature can make a CON save at the end of each of its turns to end this effect."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Brass",
                                            "entries": [
                                                "You can choose to exhale sleep gas in a 15 ft. cone with your breath weapon instead. Every creature in the area of effect must succed on a CON {@variantrule Saving Throw|Ishiir} against your breath weapon DC or fall {@condition Unconscious|Ishiir} for 10 minutes. This effect ends if the creature takes damage or another creature uses it's action to wake it."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Bronze",
                                            "entries": [
                                                "You can choose to exhale repulsive energy in a 15 ft. cone with your breath weapon instead. Every creature in the area of effect must succed on a STR {@variantrule Saving Throw|Ishiir} against your breath weapon DC or take bludgeoning damage equal to half your breath weapon damage and be pushed away 30 feet and knocked {@condition Prone|Ishiir}. If it collides with a creature or object, both it and the creature or object take bludgeoning damage equal to half your breath weapon damage."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Copper",
                                            "entries": [
                                                "You can choose exhale befuddling gas in a 15 ft. cone with your breath weapon instead. Every creature in the area of effect must succed on a WIS {@variantrule Saving Throw|Ishiir} against your breath weapon DC or fall {@condition Prone|Ishiir} laughing incontrollably for 1 minute. While under this effect, a creature is {@condition Incapacitated|Ishiir} and cannot stand up. A creature with an Intelligence score of 4 or less isn't affected.",
                                                "At the end of each of its turns, and when it takes damage, an affected creature can repeat the {@variantrule Saving Throw|Ishiir}, ending the effect on a success."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Gold",
                                            "entries": [
                                                "You can choose to exhale weakening energy with your breath weapon instead. Every creature in the area of effect must succeed on a CON {@variantrule Saving Throw|Ishiir}. If it fails, it suffers 1 level of exhaustion at the start of each of its turns for 1 minute. An affected creature can make a CON save at the end of each of its turns. On a success, it does not suffer a level of exhaustion at the beginning of its next turn, but the effect persists. If it succeeds on the {@variantrule Saving Throw|Ishiir} three times, the effect ends."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Green",
                                            "entries": [
                                                "Every creature that failed its {@variantrule Saving Throw|Ishiir} against your breath weapon is also {@condition Poisoned|Ishiir} for 1 minute. An affected creature can make a CON save at the end of each of its turns to end this effect."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Red",
                                            "entries": [
                                                "Your breath weapon's damage increases by {@dice 2d6} times half your {@variantrule Proficiency|Ishiir} (rounded down) and the base size of its cone increases to 45 ft.",
                                                "Additionally every creature that failed its {@variantrule Saving Throw|Ishiir} against your breath weapon is also set aflame and takes fire damage equal to double your {@variantrule Proficiency|Ishiir} modifier at the beginning of each of its turns for 1 minute. An affected creature can make a DEX save at the end of each of its turns to end this effect."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Silver",
                                            "entries": [
                                                "You can choose to exhale paralyzing energy in a 15 ft. cone with your breath weapon instead. Every creature in the area of effect must succed on a CON {@variantrule Saving Throw|Ishiir} against your breath weapon DC or be {@condition Paralyzed|Ishiir} for 1 minute. A creature can make a CON save at the end of each of its turns to end this effect."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "White",
                                            "entries": [
                                                "Every creature that failed its {@variantrule Saving Throw|Ishiir} against your breath weapon is also {@condition Restrained|Ishiir} for 1 minute. An affected creature can make a STR save at the end of each of its turns to end this effect."
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Animal Handler",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "wis": 1
                }
            ],
            "skillProficiencies": [
                {
                    "animal handling": true
                }
            ],
            "entries": [
                "You master the techniques needed to train and handle animals. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Animal Handling} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You can use a bonus action on your turn to command one friendly beast within 60 feet of you that can hear you and that isn't currently following the command of someone else. You decide now what action the beast will take and where it will move during its next turn, or you issue a general command that lasts for 1 minute, such as to guard a particular area."
                    ]
                }
            ]
        },
        {
            "name": "Animal Senses",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "wis": 1
                }
            ],
            "skillProficiencies": [
                {
                    "perception": true
                }
            ],
            "entries": [
                "You have keen senses, like those of an animal.",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Perception} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You have {@variantrule Advantage|Ishiir} on Wisdom ({@skill Survival}) checks made to follow tracks 24h or less old. This {@variantrule Advantage|Ishiir} is lost if it rains more than lightly, or the target travels across or through water."
                    ]
                }
            ]
        },
        {
            "name": "Anointer",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 1,
                        "class": {
                            "name": "Cleric",
                            "visible": true
                        }
                    }
                },
                {
                    "level": {
                        "level": 1,
                        "class": {
                            "name": "Paladin",
                            "visible": true
                        }
                    }
                }
            ],
            "ability": [
                {
                    "cha": 1
                }
            ],
            "additionalSpells": [
                {
                    "innate": {
                        "3": {
                            "rest": {
                                "1": [
                                    "magic weapon|Ishiir"
                                ]
                            }
                        },
                        "_": {
                            "rest": {
                                "1": [
                                    "bless|Ishiir",
                                    "heroism|Ishiir"
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "You have been trained and blessed in the ability to create and use holy water. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You may bless a container of water or other reasonably pure liquid in an equivalent amount to a flask of holy water to convert it into a single use of short-lived holy water. This holy water has all the properties of normal holy water, but it becomes normal liquid again after you use this ability again, or 24 hours later. Once you have used this ability, you cannot do so again until you have completed a {@variantrule Short Rest|Ishiir}.",
                        "You may expend a flask of holy water to cast the {@spell bless|Ishiir} or {@spell heroism|Ishiir} spell on a single target you touch with the water. The spell requires no slot and requires no {@condition Concentration|Ishiir} from you, but lasts as long as the recipient of it concentrates on it, up to its normal duration. Once you have reached level 3, you may choose to cast the {@spell magic weapon|Ishiir} spell instead as a 2nd level spell, with {@condition Concentration|Ishiir} of the spell passing to a creature you touch as part of the casting. Once you have cast any spell in this fashion, you cannot use this ability again until you have completed a {@variantrule Short Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Veteran of the Wilds",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Ranger",
                            "visible": true
                        }
                    }
                }
            ],
            "skillProficiencies": [
                {
                    "perception": true,
                    "stealth": true
                }
            ],
            "entries": [
                "Choose two of the following benefits when you gain this feat:",
                {
                    "type": "list",
                    "items": [
                        "Choose {@skill Animal Handling}, {@skill Nature}, {@skill Perception}, {@skill Stealth}, or {@skill Survival}. You gain {@variantrule Proficiency|Ishiir} in the chosen skill. If you are already proficient with it, your {@variantrule Proficiency|Ishiir} bonus is doubled for any check you make with it. If roll a 7 or lower on the 20 for a check with the chosen skill, treat the roll as an 8.",
                        "When you take the {@action Attack|Ishiir} action while hidden, all your attacks benefit from {@variantrule Advantage|Ishiir} rather than only the first one. Additionally, you deal your favorite enemy bonus damage to all of these attacks. If the target is already one of your favorite enemies, this damage stacks with the usual bonus damage.",
                        "You learn the {@spell Hunter's Mark|Ishiir} spell or a different spell from the ranger spell list if you already know it. Hunter's Mark no longer requires {@condition Concentration|Ishiir} when you cast it and instead lasts for the duration or until you are {@condition Incapacitated|Ishiir}.",
                        "Choose a creature type and add it to your favored enemies, gaining the usual benefits. Additinally, the bonus damage you deal to your favored enemies increases by an amount equal to your Wisdom modifier."
                    ]
                }
            ]
        },
        {
            "name": "Apothecary",
            "page": 1,
            "source": "Ishiir",
            "toolProficiencies": [
                {
                    "alchemist's supplies": true,
                    "herbalism kit": true
                }
            ],
            "entries": [
                "You are skilled at gathering and using herbs for healing and harm.",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with the {@item herbalism kit|Ishiir} and {@item alchemist's supplies|Ishiir}. You are already proficient in these tools, your {@variantrule Proficiency|Ishiir} bonus is doubled for any skill check you make with them.",
                        "If you craft an item with your {@item herbalism kit|Ishiir} or {@item alchemist's supplies|Ishiir} that has a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold."
                    ]
                }
            ]
        },
        {
            "name": "Arcane Prodigy",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Wizard",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on Constitution {@variantrule Saving Throw|Ishiir|Saving Throws} that you make to maintain your {@condition Concentration|Ishiir} on a spell when you take damage.",
                        "Additionally, when you hold {@condition Concentration|Ishiir} on a spell, you can maintain {@condition Concentration|Ishiir} of one additional spell for a number of rounds equal to half your {@variantrule Proficiency|Ishiir} (rounded down).",
                        "At the end of your turn when this effect ends, you can choose which spell to maintain {@condition Concentration|Ishiir} on."
                    ]
                }
            ]
        },
        {
            "name": "Arcanist",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "int": 1
                }
            ],
            "skillProficiencies": [
                {
                    "arcana": true
                }
            ],
            "additionalSpells": [
                {
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    "detect magic|Ishiir"
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            "prestidigitation|Ishiir#c"
                        ]
                    }
                }
            ],
            "entries": [
                "You study the arcane arts, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Arcana} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You learn the {@spell prestidigitation|Ishiir} and {@spell detect magic|Ishiir} spells. You can cast {@spell detect magic|Ishiir} once without expending a spell slot, and you regain the ability to do so when you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Arcanoficer",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Artificer",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You learn one additional infusion and can have one additional infusion active.",
                        "You ignore the restriction to non-magical items when you infuse an item."
                    ]
                }
            ]
        },
        {
            "name": "Artificer Initiate",
            "page": 1,
            "source": "Ishiir",
            "toolProficiencies": [
                {
                    "anyArtisansTool": true
                }
            ],
            "additionalSpells": [
                {
                    "ability": "int",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Artificer (Ishiir)|source=Ishiir"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Artificer (Ishiir)|source=Ishiir"
                            }
                        ]
                    }
                }
            ],
            "entries": [
                "You've learned some of an artificer's inventiveness:",
                {
                    "type": "list",
                    "items": [
                        "You learn one cantrip of your choice from the {@filter artificer spell list|spells|level=0;1|class=artificer (Ishiir)|source=Ishiir}, and you learn one 1st-level spell of your choice from {@filter that list|spells|level=0;1|class=artificer (Ishiir)|source=Ishiir}. Intelligence, Wisdom, or Charisma (your choice) is your spellcasting ability for these spells.",
                        "You can cast this feat's 1st-level spell without a spell slot, and you must finish a {@variantrule Long Rest|Ishiir} before you can cast it in this way again. You can also cast the spell using any spell slots you have.",
                        "You gain {@variantrule Proficiency|Ishiir} with one type of {@filter artisan's tools|items|type=artisan's tools} of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses Intelligence as its spellcasting ability."
                    ]
                }
            ]
        },
        {
            "name": "Artisan of War",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Fighter",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you use your Second Wind class feature, roll additional {@dice d10} equal to half your {@variantrule Proficiency|Ishiir} modifier (rounded down) and add the result to the amount healed. You can do so only once until you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}.",
                        "In addition, choose from one of the following expert fighting styles. You can only choose a style for which you have attained the base version.",
                        {
                            "type": "list",
                            "items": [
                                {
                                    "type": "list",
                                    "style": "list-hang-notitle",
                                    "items": [
                                        {
                                            "type": "item",
                                            "name": "Expert Archery",
                                            "entries": [
                                                "Your attacks no longer suffer from {@variantrule Disadvantage|Ishiir} because your target is prone. When you hit a target that currently benefits from half or three-quarters cover with a ranged weapon attack, that target can no longer benefit from half or three-quarters cover until the start of its next turn."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Blindfighting",
                                            "entries": [
                                                "The range of your blindsight increases to 20 ft."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Defense",
                                            "entries": [
                                                "While wearing armor, you also receive a +1 bonus to all {@variantrule Saving Throw|Ishiir|Saving Throws}."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Dueling",
                                            "entries": [
                                                "When combat begins but before any initiative is rolled, you can draw a one-handed melee weapon immediately and add your {@variantrule Proficiency|Ishiir} bonus to your initiative roll. Your {@variantrule Attack Roll|Ishiir}s with this weapon have {@variantrule Advantage|Ishiir} against any target that hasn't yet acted during the first turn of combat."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Great-Weapon Fighting",
                                            "entries": [
                                                "You add half your STR modifier (rounded down) to any damage roll made with a two-handed melee weapon or versatile weapon wielded in two hands. If you land a critical hit with such a weapon, you add an additional weapon die to the damage dice rolled."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Interception",
                                            "entries": [
                                                "If you use the feature from the Interception fighting style to reduce the damage of an attack, you add your highest class level to the result of the roll."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Mariner",
                                            "entries": [
                                                "As long as you are not wearing heavy armor or using a shield, you receive a +1 bonus to all {@variantrule Saving Throw|Ishiir|Saving Throws}."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Protection",
                                            "entries": [
                                                "If you use the feature from the Protection fighting style to impose {@variantrule Disadvantage|Ishiir} on a creature's {@variantrule Attack Roll|Ishiir} and the attack hits, the target of the attack has {@variantrule Resistance|Ishiir} to the attack's damage."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Superior Technique",
                                            "entries": [
                                                "You gain an additional superiority die and learn an additional maneuver available to the Battle Master archetype. Additionally, the die size of the superiority die increases by one."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Thrown Weapon Fighting",
                                            "entries": [
                                                "Your attacks with a thrown weapon have their range increased by 10 feet, and their long range increased by 30 ft. Additionally, your critical range for ranged attacks with thrown weapons increases by 1."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Two-Weapon Fighting",
                                            "entries": [
                                                "The damage die of your weapons increases by one size if you dual wield them.",
                                                "When you make a melee weapon attack using your reaction (excluding readied actions) you may also make an attack with your off-hand weapon as part of the same reaction."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Expert Unarmed Fighting",
                                            "entries": [
                                                "The damage die of your unarmed strikes and the extra damage you inflict against grappled creatures is increased by one size. Additionally, this damage counts as magical for the purpose of ignoring {@variantrule Resistance|Ishiir} and {@variantrule Immunity|Ishiir}."
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Athlete",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You have undergone extensive physical training to gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you are {@condition Prone|Ishiir}, standing up uses only 5 feet of your movement.",
                        "Climbing doesn't cost you extra movement.",
                        "You can make a running long jump or a running high jump after moving only 5 feet on foot, rather than 10 feet."
                    ]
                }
            ]
        },
        {
            "name": "Bardic Music",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Bard",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you spend a bardic inspiration die for an effect on a creature, you can choose to effect a number of creatures other than you equal to your CHA modifier who can hear you in a 30 ft radius around you instead.",
                        "The die size of bardic inspiration given in this manner is reduced by 1 step compared to what it would normally be."
                    ]
                }
            ]
        },
        {
            "name": "Beast Shape",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "wis": 1
                }
            ],
            "entries": [
                "You have the unusual ability to assume the form of a beast.",
                {
                    "type": "list",
                    "items": [
                        "When you gain this feat, choose a single beast of no larger than your own actual size, with a CR no greater than 1/4, or 1/8 if the beast has a {@variantrule Fly Speed|Ishiir}. As an action, you can assume the shape of this beast (and only this beast) as if you were using the druid's Wild Shape feature. You can remain in the shape of this beast for a number of hours equal to your level. Except as noted here, this ability functions identically to the druid's Wild Shape feature. Once you have used this feat, you cannot do so again until you have completed a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Blade Mastery",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You master the {@item dagger|Ishiir}, {@item elvish sword|Ishiir}, {@item shortsword|Ishiir}, {@item longsword|Ishiir}, {@item scimitar|Ishiir}, {@item sickle|Ishiir}, {@item rapier|Ishiir}, and {@item greatsword|Ishiir}. You gain the following benefits when using any of them:",
                {
                    "type": "list",
                    "items": [
                        "Whenever you have {@variantrule Advantage|Ishiir} on an {@variantrule Attack Roll|Ishiir}, you can reroll one of the dice once.",
                        "Your AC increases by 1 while wielding one of the above weapons."
                    ]
                }
            ]
        },
        {
            "name": "Blind Fighter",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You are unusually skilled at fighting without relying on your vision.",
                {
                    "type": "list",
                    "items": [
                        "Other creatures do not gain {@variantrule Advantage|Ishiir} for attacking you while hidden.",
                        "You do not suffer {@variantrule Disadvantage|Ishiir} for attacking creatures you cannot see.",
                        "You can use the {@action Search|Ishiir} action to locate a hidden creature as a bonus action."
                    ]
                }
            ]
        },
        {
            "name": "Bloodlust",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "orc"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your {@variantrule Proficiency|Ishiir} modifier + your character level. These temporary hit points last until you are no longer in combat.",
                        "Additionally, when you use your Relentless Endurance feature, you can also remove all conditions from yourself that allow for a repeat save at the end of your turn."
                    ]
                }
            ]
        },
        {
            "name": "Bountiful Luck",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "halfling"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "dex",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Your people have extraordinary luck, which you have learned to mystically lend to your companions when you see them falter. You're not sure how you do it; you just wish it, and it happens. Surely a sign of fortune's favor!",
                {
                    "type": "list",
                    "items": [
                        "When an ally you can see within 30 feet of you rolls a 1 on the {@dice d20} for an {@variantrule Attack Roll|Ishiir}, an {@variantrule Ability Check|Ishiir}, or a {@variantrule Saving Throw|Ishiir}, you can use your reaction to let the ally reroll the die. The ally must use the new roll."
                    ]
                }
            ]
        },
        {
            "name": "Brawny",
            "source": "Ishiir",
            "page": 1,
            "ability": [
                {
                    "str": 1
                }
            ],
            "skillProficiencies": [
                {
                    "athletics": true
                }
            ],
            "entries": [
                "You become stronger, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Athletics} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You count as if you were one size larger for the purpose of determining your carrying capacity."
                    ]
                }
            ]
        },
        {
            "name": "Burglar",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "dex": 1
                }
            ],
            "toolProficiencies": [
                {
                    "thieves' tools": true
                }
            ],
            "entries": [
                "You pride yourself on your quickness and your close study of certain clandestine activities. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with {@item thieves' tools|phb}. If you are already proficient with them, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with them.",
                        "You never break your thieves's tools as a result of failing to open a lock and if you fail to disarm a trap, you do not trigger it."
                    ]
                }
            ]
        },
        {
            "name": "Cast Iron Stomach",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "con": 1
                }
            ],
            "entries": [
                "You have a sturdy constitution that allows you to stomach anything without complaint.",
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on {@variantrule Saving Throw|Ishiir|Saving Throws} against poison and {@variantrule Resistance|Ishiir} to poison damage. If you have {@variantrule Resistance|Ishiir} to poison damage from another source, you are {@variantrule Immunity|Ishiir|Immune} to all ingested poison.",
                        "You are {@variantrule Immunity|Ishiir|Immune} to revolting smells (such as that of a troglodyte) and can eat spoiled or rotten food without ill effect."
                    ]
                }
            ]
        },
        {
            "name": "Charger",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you use your action to {@action Dash|Ishiir}, you can use a bonus action to make one melee weapon attack or to {@action shove|Ishiir} a creature.",
                        "Once per turn, if you move at least 10 feet in a straight line before making a melee attack, you either gain a +5 bonus to the attack's damage roll (if you chose to make a melee attack and hit) or push the target up to 10 feet away from you (if you chose to shove and you succeed)."
                    ]
                }
            ]
        },
        {
            "name": "Chef",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "dex",
                            "con",
                            "int",
                            "wis"
                        ],
                        "amount": 1
                    }
                }
            ],
            "toolProficiencies": [
                {
                    "cook's utensils": true
                }
            ],
            "entries": [
                "Time spent mastering the culinary arts has paid off, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with {@item cook's utensils|Ishiir} if you don't already have it. If you are already proficient, your {@variantrule Proficiency|Ishiir} bonus is doubled for every skill check you make with them.",
                        "As part of a {@variantrule Short Rest|Ishiir}, you can cook special food, provided you have ingredients and {@item cook's utensils|Ishiir} on hand. You can prepare enough of this food for a number of creatures equal to 4 + your {@variantrule Proficiency|Ishiir} bonus. At the end of the {@variantrule Short Rest|Ishiir}, any creature who eats the food and spends one or more Hit Dice to regain hit points regains an extra {@dice 1d8} hit points.",
                        "With one hour of work or when you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}, you can cook a number of treats equal to your {@variantrule Proficiency|Ishiir} bonus. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain temporary hit points equal to your {@variantrule Proficiency|Ishiir} bonus."
                    ]
                }
            ]
        },
        {
            "name": "Circle Adept",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human",
                            "subrace": "Diithiri"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose one arcane school: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, Transmutation.",
                        "You learn a number of additional spells from your chosen school equal to half your {@variantrule Proficiency|Ishiir} bonus (rounded down). These spells can come from any spell list and count as class spells for you. You can only choose spells for which you have spell slots. When you level up, you can exchange one of these spells with a different one of your choice that meets the same criteria.",
                        "When you cast a spell of your chosen school by expending one of your spell slots, you can treat it as one spell level higher than the spell slot you expended for the purpose of determining its effects. It's still considered the same spell level as the spell slot expended for all other interactions (such as with an opposing {@spell Dispel Magic|Ishiir})."
                    ]
                }
            ]
        },
        {
            "name": "Combat Reflexes",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "dex",
                            "wis"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Your reflexes are highly honed and you are always on the lookout for opportunities.",
                {
                    "type": "list",
                    "items": [
                        "When an enemy provokes an {@action opportunity attack|Ishiir} from you, you can make the attack without spending a reaction, but you cannot make another {@action opportunity attack|Ishiir} during that turn."
                    ]
                }
            ]
        },
        {
            "name": "Combat Training",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "proficiency": [
                        {
                            "weapon": "martial"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Intensive training has allowed you to learn and benefit from a combat style.",
                {
                    "type": "list",
                    "items": [
                        "You learn one Fighting Style, chosen from among those available to any class. You cannot choose the same fighting style twice, even if you are later given the opportunity to choose another."
                    ]
                }
            ]
        },
        {
            "name": "Common Sense",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You have an unusually high level of intuition or an overly rational approach to problem solving, either of which allows you to avoid common pitfalls and find solutions to thorny problems more easily.",
                {
                    "type": "list",
                    "items": [
                        "You have three common sense points. Once expended, these points are refreshed when you complete a {@variantrule Long Rest|Ishiir}. If you do something that the DM considers to be a bad idea (defined as something with consequences the DM believes to be obvious or intrinsic to the situation, but which you have not considered) while you have common sense points remaining, the DM will tell you, taking one common sense point and allowing you a chance to reconsider your action.",
                        "You may spend a common sense point at any time to ask the DM for advice. The DM will tell you anything about the current situation you're overlooking and suggest a course of action. This suggestion need not be (and is not likely to be) a detailed plan of action, but a starting point."
                    ]
                }
            ]
        },
        {
            "name": "Critter Friend",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "gnome",
                            "subrace": "Forest"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "skillProficiencies": [
                {
                    "animal handling": true
                }
            ],
            "additionalSpells": [
                {
                    "ability": "int",
                    "innate": {
                        "_": {
                            "will": [
                                "speak with animals|Ishiir"
                            ],
                            "daily": {
                                "1": [
                                    "animal friendship|Ishiir"
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "Your friendship with animals mystically deepens. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Animal Handling} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You learn the {@spell speak with animals|Ishiir} spell and can cast it at will, without expending a spell slot. You also learn the {@spell animal friendship|Ishiir} spell, and you can cast it once with this feat, without expending a spell slot. You regain the ability to cast it in this way when you finish a {@variantrule Long Rest|Ishiir}. Intelligence is your spellcasting ability for these spells."
                    ]
                }
            ]
        },
        {
            "name": "Crossbow Expert",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "Thanks to extensive practice with the crossbow, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You ignore the loading quality of crossbows with which you are proficient.",
                        "Being within 5 feet of a hostile creature doesn't impose {@variantrule Disadvantage|Ishiir} on your ranged {@variantrule Attack Roll|Ishiir}s.",
                        "When you use the {@action Attack|Ishiir} action and attack with a one-handed weapon, you can use a bonus action to attack with a {@item crossbow, hand|Ishiir|hand crossbow} you are holding."
                    ]
                }
            ]
        },
        {
            "name": "Crusher",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "con"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You are practiced in the art of crushing your enemies, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 5 feet to an unoccupied space, provided the target is no more than one size larger than you.",
                        "When you score a critical hit that deals bludgeoning damage to a creature, {@variantrule Attack Roll|Ishiir}s against that creature are made with {@variantrule Advantage|Ishiir} until the start of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Dagger Master",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You have mastered the dagger, the quintessential weapon of rogues and murderers, until it is practically an extension of your body.",
                {
                    "type": "list",
                    "items": [
                        "When you wield a dagger, its damage die is {@dice 1d6}, not {@dice 1d4}, and its throwing range is 30/90.",
                        "A hand wielding a dagger is considered to be empty for purposes of somatic components of spells and the duelist fighting style.",
                        "If you are wielding a dagger and another melee weapon in separate hands, you gain a +1 bonus to AC."
                    ]
                }
            ]
        },
        {
            "name": "Dark Thirst",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "shadowborn"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you use your Siphon Shadows class feature, you regain an amount of hit points equal to the necrotic damage you would have taken, rather than half.",
                        "If you reduce a creature to 0 hit points, you can use your Siphon Life racial feature as a bonus action.",
                        "When you finish a {@variantrule Long Rest|Ishiir}, you regain all expended hit dice back rather than half your maximum."
                    ]
                }
            ]
        },
        {
            "name": "Deep Forged",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "dwarf",
                            "subrace": "Mountain"
                        }
                    ]
                }
            ],
            "skillProficiencies": [
                {
                    "perception": true
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Your {@sense darkvision} range increases to 120 feet.",
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill perception} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You have {@variantrule Advantage|Ishiir} on {@variantrule Saving Throw|Ishiir|Saving Throws} against being {@condition Charmed|Ishiir} or {@condition Frightened|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Defensive Duelist",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you are wielding a weapon or a shield with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your {@variantrule Proficiency|Ishiir} bonus to your AC for that attack, potentially causing the attack to miss you."
                    ]
                }
            ]
        },
        {
            "name": "Die Hard",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "con": 1
                }
            ],
            "entries": [
                "Some people just don't know when to quit. You're one of them.",
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on death {@variantrule Saving Throw|Ishiir|Saving Throws}.",
                        "If you are reduced to 0 hit points but aren't killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Diplomat",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "cha": 1
                }
            ],
            "skillProficiencies": [
                {
                    "persuasion": true
                }
            ],
            "entries": [
                "You master the arts of diplomacy, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Persuasion} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "If you spend 1 minute talking to someone who can understand what you say, you can make a Charisma ({@skill Persuasion}) check contested by the creature's Wisdom ({@skill Insight}) check. If you or your companions are fighting the creature, your check automatically fails. If your check succeeds, the target is {@condition Charmed|Ishiir} by you as long as it remains within 60 feet of you and for 1 minute thereafter."
                    ]
                }
            ]
        },
        {
            "name": "Disciple of Eisenherz",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human",
                            "subrace": "Andragastan"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you land a critical hit with a melee weapon, roll an additional weapon die and add it to the damage total.",
                        "When you push or knock a creature prone successfully with the {@action shove|Ishiir} action, you can make a melee weapon attack as a bonus action.",
                        "If you have features that allow you to {@action shove|Ishiir} on a bonus action and you succeed on that shove, you can make a melee weapon attack as part of the same bonus action.",
                        "You can attempt a {@action grapple|Ishiir} while wielding a two-handed or versatile weapon in one hand. While grappling a creature, you can still make attacks with your weapon as if you were wielding it in two hands."
                    ]
                }
            ]
        },
        {
            "name": "Disciple of La Lis de Fer",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human",
                            "subrace": "Nostrian"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "On your turn, when you move towards a creature in a straight line for the first time, you can add 1 dmg for every 5 ft spent as part of that movement to the first melee weapon damage roll you make against that creature.",
                        "Your critical range with melee weapons increases by 1. This effect does not apply to weapons with the heavy or two-handed property.",
                        "When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn."
                    ]
                }
            ]
        },
        {
            "name": "Divine Channel",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You have been blessed with a limited ability to Channel Divinity. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Choose any two Channel Divinity features that are available to clerics or paladins of 3rd level or lower. You gain one use of Channel Divinity that can be used for these or any other Channel Divinity features you have. You regain this use when you have completed a {@variantrule Long Rest|Ishiir}. If the Channel Divinity feature references your cleric level, you use your highest class level instead. If you already possess the Channel Divinity feature, the use granted by this feat recharges on a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir} instead."
                    ]
                }
            ]
        },
        {
            "name": "Divine Conduit",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Cleric",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You gain an additional use of your Channel Divinity feature.",
                        "You learn an additional cantrip from the {@filter cleric spell list|spells|level=0|class=cleric (Ishiir)|source=Ishiir}.",
                        "When you use your Harness Divine Power class feature, you can regain multiple spell slots, up to a combined level equal to your {@variantrule Proficiency|Ishiir} bonus. The level of individual spell slots you regain in this manner is still limited to up to half your {@variantrule Proficiency|Ishiir} bonus (rounded up)."
                    ]
                }
            ]
        },
        {
            "name": "Dragon Fear",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "draaken"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "con",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "When angered, you radiate menace. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Instead of exhaling destructive energy, you can expend a use of your Breath Weapon trait to roar, forcing each creature of your choice within 30 feet of you to make a Wisdom {@variantrule Saving Throw|Ishiir} (DC 8 + your {@variantrule Proficiency|Ishiir} bonus + your Charisma modifier). A target automatically succeeds on the save if it can't hear or see you. On a failed save, a target becomes {@condition Frightened|Ishiir} of you for 1 minute. If the {@condition Frightened|Ishiir} target takes any damage, it can repeat the {@variantrule Saving Throw|Ishiir}, ending the effect on itself on a success. If you also have Ancient Blood feat, the radius of this feature increases to 60 feet."
                    ]
                }
            ]
        },
        {
            "name": "Dragon Hide",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "draaken"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex",
                            "con",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You manifest scales and claws reminiscent of draconic creatures. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Your scales harden. While you aren't wearing armor, you can calculate your AC as 13 + your Dexterity modifier. You can use a shield and still gain this benefit.",
                        "You grow retractable claws from the tips of your fingers. Extending or retracting the claws requires no action. The claws are natural weapons, which you can use to make unarmed strikes, and deal {@dice 1d6} slashing damage on a hit. You can choose your whether to use your Strength or Dexterity modifier for the attack and damage rolls. You must use the same modifier for both rolls.",
                        "If you have another feature or effect that modifies the die size of your unarmed attacks, that die size instead increases by 1 step if you use your claws to attack."
                    ]
                }
            ]
        },
        {
            "name": "Dual Wielder",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You master fighting with two weapons, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.",
                        "You can use two-weapon fighting even when the one-handed melee weapons you are wielding aren't light.",
                        "You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one."
                    ]
                }
            ]
        },
        {
            "name": "Dungeon Delver",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on Wisdom ({@skill Perception}) and Intelligence ({@skill Investigation}) checks made to detect the presence of secret doors, traps, and environmental hazards.",
                        "You have {@variantrule Advantage|Ishiir} on {@variantrule Saving Throw|Ishiir|Saving Throws} made to avoid or resist traps and environmental hazards.",
                        "You have {@variantrule Resistance|Ishiir} to the damage dealt by traps and environmental hazards.",
                        "Traveling at a fast pace doesn't impose the normal -5 penalty on your passive Wisdom ({@skill Perception}) score."
                    ]
                }
            ]
        },
        {
            "name": "Durable",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "con": 1
                }
            ],
            "entries": [
                "Hardy and resilient, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you roll a Hit Die to regain hit points, you maximize the result of the die roll.",
                        "When you finish a {@variantrule Long Rest|Ishiir}, you regain all spent hit dice rather than only half of your maximum."
                    ]
                }
            ]
        },
        {
            "name": "Dwarven Fortitude",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "dwarf"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "con": 1
                }
            ],
            "entries": [
                "You have the blood of dwarf heroes flowing through your veins. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Whenever you take the {@action Dodge|Ishiir} action in combat, you can spend one Hit Die to heal yourself. Roll the die, add your Constitution modifier, and regain a number of hit points equal to the total (minimum of 1).",
                        "You can spend Hit Dice outside combat as if you had taken a {@variantrule Short Rest|Ishiir}, as long as do so during a period of downtime at least 10 minutes long and you perform no strenuous activity during that time."
                    ]
                }
            ]
        },
        {
            "name": "Eldritch Adept",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "optionalfeatureProgression": [
                {
                    "name": "Eldritch Invocations",
                    "featureType": [
                        "EI"
                    ],
                    "progression": {
                        "*": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You learn one {@filter Eldritch Invocation|optionalfeatures|Feature Type=EI|source=Ishiir} option of your choice from the warlock class. If the invocation references your level for its feature or as a prerequisit to pick it, you use your highest class level instead. If the invocation has another prerequisite of any kind, you can choose that invocation only if you fulfill it. Whenever you gain a level, you can replace the invocation with another one from the warlock class."
                    ]
                }
            ]
        },
        {
            "name": "Eldritch Gift",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 1,
                        "class": {
                            "name": "Warlock",
                            "visible": true
                        }
                    }
                },
                {
                    "feat": [
                        "Pact Initiate|Ishiir"
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose a warlock Pact Boon that you do not already have. You gain this boon."
                    ]
                }
            ]
        },
        {
            "name": "Conduit Mastery",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "spellcasting": true
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you gain this feat, choose a damage type.",
                        "Spells you cast ignore {@variantrule Resistance|Ishiir} to damage of the chosen type. In addition, when you roll a 1 on a damage die for a spell you cast that deals damage of that type, you can reroll the die. You must use the new roll, even if it is a 1.",
                        "You can select this feat multiple times. Each time you do so, you must choose a different damage type."
                    ]
                }
            ]
        },
        {
            "name": "Elven Accuracy",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "elf"
                        },
                        {
                            "name": "half-elf"
                        }
                    ]
                },
                {
                    "feat": [
                        "Elven Heritage|Ishiir"
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "dex",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "The accuracy of elves is legendary, especially that of elf archers and spellcasters. You have uncanny aim with attacks that rely on precision rather than brute force. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Whenever you have {@variantrule Advantage|Ishiir} on an {@variantrule Attack Roll|Ishiir} using Dexterity, Intelligence, Wisdom, or Charisma, you can reroll one of the dice once."
                    ]
                }
            ]
        },
        {
            "name": "Elven Heritage",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "con",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    },
                    "hidden": true
                }
            ],
            "entries": [
                "You have some elven blood, or, if you are an elf, some other elven blood.",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in Perception. Choose an elven sub-race to which you do not belong, and gain the following benefits:",
                        {
                            "type": "list",
                            "items": [
                                "High Elf: Your Intelligence, Wisdom, or Charisma (your choice) increases by 1, to a maximum of 20, and you gain your choice of one of the following High Elf subrace features: one skill from High Elf Education, Cantrip, or Extra Language.",
                                "Wood Elf: Your Strength, Constitution, or Wisdom (your choice) increases by 1, to a maximum of 20, and you gain your choice of one of the following Wood Elf subrace features: Elf Weapon Training, Fleet of Foot, Born Predator, One with the Wild, Mask of the Wild.",
                                "Dark Elf: Your Strength, Wisdom, or Charisma (your choice) increases by 1, to a maximum of 20, and you gain your choice of one the following Dark Elf subrace features: Elf Weapon Training, Dark Elf Spellcasting (except Healing Spirit)."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Empathic",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "wis": 1
                }
            ],
            "skillProficiencies": [
                {
                    "insight": true
                }
            ],
            "entries": [
                "You possess keen insight into how other people think and feel. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Insight} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You can use your action to try to get uncanny insight about one creature you can see within 30 feet of you. Make a Wisdom ({@skill Insight}) check contested by the target's Charisma ({@skill Deception}) check. If the target creature's Intelligence is 6 or lower, this feature has no effect. If your check succeeds, you have {@variantrule Advantage|Ishiir} on {@variantrule Attack Roll|Ishiir}s and {@variantrule Ability Check|Ishiir}s against the target until the end of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Empathy",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "wis": 1
                }
            ],
            "entries": [
                "You have an unusual level of insight into the minds and emotions of others.",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Advantage|Ishiir} on Wisdom ({@skill Insight}) checks against humanoid creatures.",
                        "If you succeed on a Wisdom ({@skill Insight}) check involving a creature, the DM may tell you one piece of information about the character's personality or state of mind in addition to whatever information you gleaned. Additionally, if the creature lies to you, you will know it. This later facet lasts until you have taken a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Everybody's Friend",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "cha": 1
                }
            ],
            "skillProficiencies": [
                {
                    "deception": true,
                    "persuasion": true
                }
            ],
            "entries": [
                "You develop your magnetic personality to ease your way through the world. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Deception} and {@skill Persuasion} skills. If you're already proficient in either skill, your {@variantrule Proficiency|Ishiir} bonus is doubled for any check you make with that skill."
                    ]
                }
            ]
        },
        {
            "name": "Extraordinary Defense",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex",
                            "con",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You learn to defend yourself through special training or supernatural means, eschewing the need for armor.",
                {
                    "type": "list",
                    "items": [
                        "Choose a second ability score. While you are wearing no armor and not wielding a shield, your AC equals 10 + the modifier of your first chosen ability score + the modifier of your second chosen ability score."
                    ]
                }
            ]
        },
        {
            "name": "Expert",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex",
                            "con",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "expertise": [
                {
                    "anyProficientSkill": 1
                }
            ],
            "toolProficiencies": [
                {
                    "any": 1
                }
            ],
            "entries": [
                "You are a perfectionist when it comes to skills, and you have practiced one skill in particular until it is second nature to you.",
                {
                    "type": "list",
                    "items": [
                        "Choose one of your skill or tool proficiencies. You now have expertise with this skill or tool, allowing you to add double your normal {@variantrule Proficiency|Ishiir} bonus to any {@variantrule Ability Check|Ishiir} that would benefit from it.",
                        "When you make an {@variantrule Ability Check|Ishiir} that benefits from part or all of your {@variantrule Proficiency|Ishiir} bonus and you roll a 1 on the {@dice d20}, you may re-roll the die, though you must use the second result."
                    ]
                }
            ]
        },
        {
            "name": "Eye for Opportunity",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "dwarf",
                            "subrace": "Hill"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You receive a bonus to your initiative rolls equal to your DEX, WIS, INT, or CHA modifier (your choice).",
                        "When you or a creature you can see within 30 feet of you makes an {@variantrule Ability Check|Ishiir} or an {@variantrule Attack Roll|Ishiir}, you can use your reaction to add your DEX, WIS, INT, or CHA modifier to the roll (your choice).",
                        "You can use this feature a number of times equal to the your {@variantrule Proficiency|Ishiir} modifier. You regain all expended uses on a {@variantrule Long Rest|Ishiir}.",
                        "When initiative is rolled and you are not surprised, you can choose a number of hostile creatures equal to half your {@variantrule Proficiency|Ishiir} modifier (rounded down) to reroll their initiative and keep the lower result."
                    ]
                }
            ]
        },
        {
            "name": "Fade Away",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "gnome"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "dex",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Your people are clever, with a knack for illusion magic. You have learned a magical trick for fading away when you suffer harm. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Immediately after you take damage, you can use a reaction to magically teleport to an unoccupied square you can see within 30 feet and  become {@condition Invisible|Ishiir} until the end of your next turn or until you attack, deal damage, or force someone to make a {@variantrule Saving Throw|Ishiir}. Once you use this ability, you can't do so again until you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Faith Healer",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You have the ability to heal with a touch, represented by a pool of hp equal to 5 x your {@variantrule Proficiency|Ishiir} bonus. As an action, touch a creature and spend any amount of points from this pool to heal them of an equal amount of hit points. You may spend 5 points to cure the creature of a disease or poison that afflicts them instead. You regain all expended points after you complete a {@variantrule Long Rest|Ishiir}.",
                        "If you have the paladin Lay On Hands feature, the points of healing you gain from this feat are combined with the points granted by that feature.",
                        "Additionally, by spending an action touching a creature who died within 1 minute, you may roll percentile dice. If the amount rolled is lower than or equal to your level, you cast revivify on the creature, without using a spell slot or any material components. You may only attempt this roll once per creature (unless it returns to life and then dies), and once you have succeeded on the roll you may not attempt to raise another creature in this fashion until you have completed a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Favor of Vaeraustraee",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "elf",
                            "subrace": "Dark"
                        }
                    ]
                }
            ],
            "entries": [
                "You gain the Channel Divinity feature. You can use this feature once, and again after you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}. When you use this feature, you can choose between the following options:",
                {
                    "type": "list",
                    "items": [
                        "Embrace of the Mother: As an action, you emit a wave of soothing divine energy in a radius of 30 ft around you. You and all allied creatures in this area can reroll a {@variantrule Saving Throw|Ishiir} against one effect that is currently affecting them with a bonus equal to your WIS or CHA Modifier (your choice), ending the effect on a success immediately even if the effect does not normally allow for repeat saves or requires multiple saves.",
                        "Fury of the Sworddancer: At the start of your turn, you call on the guidance of your goddess to emulate the perfection of her blade dancing. This does not require any actions. Until the start of your next turn, your movement does not provoke {@action opportunity attack|Ishiir}s, you have {@variantrule Advantage|Ishiir} on all {@variantrule Attack Roll|Ishiir}s and all {@variantrule Attack Roll|Ishiir}s against you have {@variantrule Disadvantage|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Fell Handed",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "entries": [
                "You master the {@item light hammer|Ishiir}, {@item handaxe|Ishiir}, {@item battleaxe|Ishiir}, {@item flail|Ishiir}, {@item greataxe|Ishiir}, {@item greatclub|Ishiir}, {@item mace|Ishiir}, {@item morningstar|Ishiir}, {@item warhammer|Ishiir}, {@item war pick|Ishiir}, and {@item maul|Ishiir}. You gain the following benefits when using any of them:",
                {
                    "type": "list",
                    "items": [
                        "You increase the damage die by 1 size category.",
                        "Once per turn, when you hit a creature with a melee weapon attack, you can immediately also attempt to {@action shove|Ishiir} or {@action stagger|Ishiir} the creature (no action required). You are considered one size larger for the purpose of these attempts.",
                        "When you land a critical hit, roll an additional weapon die and add it to the damage total."
                    ]
                }
            ]
        },
        {
            "name": "Fey Godchild",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "gnome",
                            "subrace": "Forest"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you roll a 1 on an {@variantrule Attack Roll|Ishiir}, {@variantrule Ability Check|Ishiir}, or {@variantrule Saving Throw|Ishiir}, you can reroll the die and must use the new roll.",
                        "As a bonus action, you can become magically {@condition Invisible|Ishiir} for 1 hour. Anything you are wearing or carrying is invisible with you. The effect ends if you attack or cast a spell. You can use this feature a number of times equal to half your {@variantrule Proficiency|Ishiir} modifier (rounded down). You regain all expended uses when you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Fey Teleportation",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "elf",
                            "subrace": "High"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "languageProficiencies": [
                {
                    "sylvan": true
                }
            ],
            "additionalSpells": [
                {
                    "ability": "int",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    "misty step|Ishiir"
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "Your study of high elven lore has unlocked fey power that few other elves possess, except your eladrin cousins. Drawing on your fey ancestry, you can momentarily stride through the Feywild to shorten your path from one place to another. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn to speak, read, and write {@language Sylvan}.",
                        "You learn the {@spell misty step|Ishiir} spell and can cast it once without expending a spell slot. You regain the ability to cast it in this way when you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}. Intelligence is your spellcasting ability for this spell."
                    ]
                }
            ]
        },
        {
            "name": "Fey Touched",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "additionalSpells": [
                {
                    "ability": "inherit",
                    "innate": {
                        "_": {
                            "daily": {
                                "1e": [
                                    "misty step|Ishiir",
                                    {
                                        "choose": "level=1|school=E;D|source=Ishiir"
                                    }
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "Your exposure to the Feywild's magic has changed you, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn the {@spell misty step|Ishiir} spell and one {@filter 1st-level spell|spells|level=1|school=E;D|source=Ishiir} of your choice. The {@filter 1st-level spell|spells|level=1|school=E;D|source=Ishiir} must be from the divination or enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a {@variantrule Long Rest|Ishiir}. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat."
                    ]
                }
            ]
        },
        {
            "name": "Fierce Flames",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "nessian"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You learn to call on hellfire to serve your commands. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you roll fire damage for a spell you cast, you can reroll any roll of 1 on the fire damage dice, but you must use the new roll, even if it is another 1.",
                        "Whenever you cast a spell that deals fire damage, you can cause flames to wreathe you until the end of your next turn. The flames don't harm you or your possessions, and they shed bright light out to 30 feet and dim light for an additional 30 feet. While the flames are present, any creature within 5 feet of you that hits you with a melee attack takes {@dice 1d4} fire damage."
                    ]
                }
            ]
        },
        {
            "name": "Fire in the Blood",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "nessian"
                        }
                    ]
                }
            ],
            "expertise": [
                {
                    "choose": {
                        "from": [
                            "deception",
                            "intimidation",
                            "persuasion"
                        ]
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose Persuasion, Intimidation, or Deception. Your {@variantrule Proficiency|Ishiir} bonus is doubled for checks using the chosen skill.",
                        "You see normally in darkness, magical and nonmagical, to a distance equal to your darkvision range.",
                        "Once on your turn, when you deal damage with a weapon attack or a spell, you can add fire damage equal to your {@variantrule Proficiency|Ishiir} bonus to the damage dealt against one creature."
                    ]
                }
            ]
        },
        {
            "name": "Free Runner",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You practice a form of extreme mobility that's especially useful for navigating obstacle-strewn landscapes like a city skyline. To benefit from this feat, you must be wearing light or no armor. While you are doing so, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Your base {@variantrule Speed|Ishiir} increases by 5.",
                        "You may use Dexterity in place of Strength for calculating jumping distance or height, and may use a Dexterity ({@skill Acrobatics}) check in place of a Strength ({@skill Athletics}) check for purposes of jumping.",
                        "When you take the {@action Dash|Ishiir} action, moving through difficult terrain, crawling, squeezing, and climbing do not cost additional movement, and when you are prone, you can stand up without spending any movement.",
                        "When participating in a chase using the rules in the Dungeon Master's Guide, you can ignore the first Constitution check you fail to avoid exhaustion."
                    ]
                }
            ]
        },
        {
            "name": "Grappler",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "ability": [
                        {
                            "str": 13
                        }
                    ]
                }
            ],
            "entries": [
                "You've developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on {@variantrule Attack Roll|Ishiir}s against a creature you are grappling.",
                        "You can use your action to try to pin a creature {@condition Grappled|Ishiir} by you. To do so, make another grapple check. If you succeed, you and the creature are both {@condition Restrained|Ishiir} until the grapple ends."
                    ]
                }
            ]
        },
        {
            "name": "Great Weapon Master",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "entries": [
                "You've learned to put the weight of a weapon to your {@variantrule Advantage|Ishiir}, letting its momentum empower your strikes. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.",
                        "Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a -5 penalty to the {@variantrule Attack Roll|Ishiir}. If the attack hits, you add +10 to the attack's damage."
                    ]
                }
            ]
        },
        {
            "name": "Hand of Faith",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Paladin",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You learn a cantrip from the {@filter cleric spell list|spells|level=0|class=cleric (Ishiir)|source=Ishiir}.",
                        "The number of times you can use Divine Smite without a spell slot now equals your {@variantrule Proficiency|Ishiir}. After you use Divine Smite, your weapon sheds bright light in a radius of 10 feet and dim light in a radius of 10 feet beyond that. This light is not smothered by magical darkness but does not dispel it.",
                        "The range of your Lay on Hands increases to 30 feet."
                    ]
                }
            ]
        },
        {
            "name": "Greater Rage",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Barbarian",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you activate or end your rage, you can do so without expending a bonus action.",
                        "Additionally, your rage damage bonus is now equivalent to your {@variantrule Proficiency|Ishiir} bonus. This only applies to the rage damage bonus itself and not any other Barbarian features that reference your rage damage bonus. If you make an attack with a two-handed weapon or a versatile weapon using both hands, your rage damage bonus increases by half (rounded down).",
                        "While raging, when you have {@variantrule Advantage|Ishiir} from using your Reckless Attack class feature, you can reroll one of the dice once."
                    ]
                }
            ]
        },
        {
            "name": "Grudge-Bearer",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex",
                            "con",
                            "wis"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You have a deep hatred for a particular kind of creature. Choose your foes, a type of creature to bear the burden of your wrath: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, oozes, plants, or undead. Alternatively, you can choose two races of humanoid (such as elfs or humans). You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "During the first round of any combat against your chosen foes, your {@variantrule Attack Roll|Ishiir}s against any of them have {@variantrule Advantage|Ishiir}.",
                        "When any of your chosen foes makes an {@action opportunity attack|Ishiir} against you, it makes the {@variantrule Attack Roll|Ishiir} with {@variantrule Disadvantage|Ishiir}.",
                        "Whenever you make an Intelligence ({@skill Arcana}, {@skill History}, {@skill Nature}, or {@skill Religion}) check to recall information about your chosen foes, you add double your {@variantrule Proficiency|Ishiir} bonus to the check, even if you're not normally proficient."
                    ]
                }
            ]
        },
        {
            "name": "Hag-Promised",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human",
                            "subrace": "Gerlundese"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on {@variantrule Saving Throw|Ishiir}ing throws against becoming charmed or cursed.",
                        "You can use your bonus action to curse a creature of your choice you can see within 90 ft. The creature is treated as under the effect of the Hex spell, except that you do not concentrate on it and it only lasts for 1 minute.",
                        "You can use this feature a number of times equal to your {@variantrule Proficiency|Ishiir} bonus. You regain all expended uses after you finish a {@variantrule Long Rest|Ishiir}.",
                        "When you are forced to make a {@variantrule Saving Throw|Ishiir} or take damage from a creature you can see within 30 ft you, you can use your reaction to force the creature to make a {@variantrule Saving Throw|Ishiir} against a DC equal to 8 + your {@variantrule Proficiency|Ishiir} + your CON, INT, WIS or CHA modifier (your choice).",
                        "On a failure, the creature is under the effect of the Bane spell, which does not require {@condition Concentration|Ishiir} and lasts until its full duration.",
                        "You can use this feature a number of times equal to half your {@variantrule Proficiency|Ishiir} bonus (rounded down). You regain all expended uses after you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Harbinger of Misfortune",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human",
                            "subrace": "Nilfinger"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You radiate bad luck in a radius of 30 ft around you.",
                        "When a creature inside this area rolls a d20 to make an attack, a {@variantrule Saving Throw|Ishiir}, or a skill check, you can roll a d8 and subtract the result of your roll from theirs.",
                        "Once you reach level 11, you roll a {@dice d10} instead.",
                        "You can use this feature three times. You can regain all expended uses on a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Hardened Survivor",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human",
                            "subrace": "Stauffener"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you take damage that drops you below 0 hitpoints but doesn't outright kill you, you drop to 1 hitpoint instead. You can't use this feature again until you finish a {@variantrule Long Rest|Ishiir}. In addition, you make death {@variantrule Saving Throw|Ishiir|Saving Throws} with {@variantrule Advantage|Ishiir}.",
                        "When you drop to 50% of your maximum hitpoints or lower in combat, you make {@variantrule Saving Throw|Ishiir|Saving Throws} against ongoing effects on you at the beginning of your turn instead of at the end.",
                        "You roll these {@variantrule Saving Throw|Ishiir|Saving Throws} before determining any of the effects that happen at the beginning of your turn."
                    ]
                }
            ]
        },
        {
            "name": "Healer",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "dex",
                            "wis"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you use a {@item healer's kit|Ishiir} to stabilize a dying creature, that creature also regains 1 hit point.",
                        "As an action, you can spend one use of a {@item healer's kit|Ishiir} to tend to a creature and restore {@dice 1d6 + 4} hit points to it, plus additional hit points equal to the creature's maximum number of Hit Dice. The creature can't regain hit points from this feat again until it finishes a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Heavily Armored",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "con"
                        ],
                        "amount": 1
                    }
                }
            ],
            "armorProficiencies": [
                {
                    "heavy": true,
                    "shields": true
                }
            ],
            "entries": [
                "You have trained to master the use of heavy armor, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with heavy armor and shields."
                    ]
                }
            ]
        },
        {
            "name": "Heavy Armor Master",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "proficiency": [
                        {
                            "armor": "heavy"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "str": 1
                }
            ],
            "entries": [
                "You can use your armor to deflect strikes that would kill others. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When an attacker that you can see hits you with a weapon attack, you can use your reaction to halve the attack's damage against you."
                    ]
                }
            ]
        },
        {
            "name": "Heir of the Fallen Empire",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human",
                            "subrace": "Ehrlangese heritage"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You can reroll your initiative and take either result.",
                        "When initiative is rolled, you can choose to give up to 6 creatures (including you) temporary HP equal to your {@variantrule Proficiency|Ishiir} + your INT, WIS, or CHA (your choice). A creature can't benefit from this feature again until it has finished a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}.",
                        "When a creature within 30 ft of you is making a {@variantrule Saving Throw|Ishiir}, you can use your reaction to add your INT, WIS, or CHA (your choice) to their roll. You can use this feature after seeing the roll but before the result is announced.",
                        "After you've used this feature, you can't use it again until you've finished a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Historian",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "int": 1
                }
            ],
            "skillProficiencies": [
                {
                    "history": true
                }
            ],
            "entries": [
                "Your study of history rewards you with the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill History} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "When you take the {@action Help|Ishiir} action to aid another creature's {@variantrule Ability Check|Ishiir}, you can make a DC 15 Intelligence ({@skill History}) check. On a success, that creature's check gains a bonus equal to your {@variantrule Proficiency|Ishiir} bonus, as you share pertinent advice and historical examples. To receive this bonus, the creature must be able to understand what you're saying."
                    ]
                }
            ]
        },
        {
            "name": "Human Determination",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex",
                            "con",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You are filled with a determination that can draw the unreachable within your reach. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you make an {@variantrule Attack Roll|Ishiir}, an {@variantrule Ability Check|Ishiir}, or a {@variantrule Saving Throw|Ishiir}, you can do so with {@variantrule Advantage|Ishiir}. Once you use this ability, you can't use it again until you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Inheritance",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "half-elf"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose one feat that has either of your parent races as requirement. You gain the full effects of that feat."
                    ]
                }
            ]
        },
        {
            "name": "Inner Focus",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "spellcasting": true
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You gain the ability to use yourself as a spellcasting focus when you cast spells that require material components."
                    ]
                }
            ]
        },
        {
            "name": "Inspiring Bravery",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "halfling",
                            "subrace": "Strongheart"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you or a creature that you can see within 30 ft of you makes a {@variantrule Saving Throw|Ishiir}, you can spend your reaction to add your {@variantrule Proficiency|Ishiir} modifier to the roll.",
                        "You can choose to use this feature after the seeing the roll but have to decide before the DM announces whether it succeeds or fails. You can use this feature a number of times equal to your {@variantrule Proficiency|Ishiir} modifier.",
                        "You regain all expended uses when you finish a {@variantrule Long Rest|Ishiir}.",
                        "When initiative is rolled, you chan choose a number of allies you can see within 30 feet of you up to a number equal to half your {@variantrule Proficiency|Ishiir} modifier (rounded down). Those allies can replace their intitiative result with yours if theirs is lower. You can choose to use this effect after seeing their roll."
                    ]
                }
            ]
        },
        {
            "name": "Inspiring Leader",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "ability": [
                        {
                            "cha": 13
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "cha": 1
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + your Charisma modifier. A creature can't gain temporary hit points from this feat again until it has finished a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Investigator",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "int": 1
                }
            ],
            "skillProficiencies": [
                {
                    "investigation": true
                }
            ],
            "entries": [
                "You have an eye for detail and can pick out the smallest clues. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Investigation} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You can take the {@action Search|Ishiir} action as a bonus action."
                    ]
                }
            ]
        },
        {
            "name": "Jinx",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "When it comes to bad luck, you seem to be a carrier.",
                {
                    "type": "list",
                    "items": [
                        "When a creature you can see makes a {@variantrule Saving Throw|Ishiir}, {@variantrule Ability Check|Ishiir}, or {@variantrule Attack Roll|Ishiir}, you can force them to roll an additional die and use the lowest die roll from among those rolled. A creature with the legendary {@variantrule Resistance|Ishiir} feature can expend a use of that feature to negate this effect.",
                        "If the same attempt is being affected by both the Luck feat and this feat, all die rolls are thrown out and a single die roll is rolled. This roll cannot then be altered by any ability that allows for a reroll or rolling additional d20s.",
                        "Once you've used this feat, you cannot do so again until you've completed a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Keen Mind",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You always know which way is north.",
                        "You always know the number of hours left before the next sunrise or sunset.",
                        "You can accurately recall anything you have seen or heard within the past month."
                    ]
                }
            ]
        },
        {
            "name": "Kinetic Wellspring",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Kineticist",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Your maximum kinesis points increase by an amount equal to your {@variantrule Proficiency|Ishiir} bonus and when you use your Gather Power class feature, you regain an additional amount of kinesis points equal to your {@variantrule Proficiency|Ishiir} bonus.",
                        "When you take a rest and spend one or more hit dice, you can choose to regain 1 kinesis point per die instead of regaining hitpoints. You can choose any number of hit dice you spent and regain hitpoints as normal for any remaining ones."
                    ]
                }
            ]
        },
        {
            "name": "Lightly Armored",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "armorProficiencies": [
                {
                    "light": true
                }
            ],
            "entries": [
                "You have trained to master the use of light armor, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with light armor and shields."
                    ]
                }
            ]
        },
        {
            "name": "Linguist",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "int": 1
                }
            ],
            "languageProficiencies": [
                {
                    "any": 3
                }
            ],
            "entries": [
                "You have studied languages and codes, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn three languages of your choice.",
                        "You can ably create written ciphers. Others can't decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your {@variantrule Proficiency|Ishiir} bonus), or they use magic to decipher it."
                    ]
                }
            ]
        },
        {
            "name": "Lucky",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You have inexplicable luck that seems to kick in at just the right moment.",
                {
                    "type": "list",
                    "items": [
                        "You have 3 luck points. Whenever you make an {@variantrule Attack Roll|Ishiir}, an {@variantrule Ability Check|Ishiir}, or a {@variantrule Saving Throw|Ishiir}, you can spend one luck point to roll an additional {@dice d20}. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the {@dice d20}s is used for the {@variantrule Attack Roll|Ishiir}, {@variantrule Ability Check|Ishiir}, or {@variantrule Saving Throw|Ishiir}.",
                        "You can also spend one luck point when an {@variantrule Attack Roll|Ishiir} is made against you. Roll a {@dice d20}, and then choose whether the attack uses the attacker's roll or yours. If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled.",
                        "You regain your expended luck points when you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Mage Slayer",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature.",
                        "When you damage a creature that is concentrating on a spell, that creature has {@variantrule Disadvantage|Ishiir} on the {@variantrule Saving Throw|Ishiir} it makes to maintain its {@condition Concentration|Ishiir}.",
                        "You have {@variantrule Advantage|Ishiir} on {@variantrule Saving Throw|Ishiir|Saving Throws} against spells cast by creatures within 5 feet of you."
                    ]
                }
            ]
        },
        {
            "name": "Magic Initiate",
            "page": 1,
            "source": "Ishiir",
            "additionalSpells": [
                {
                    "name": "Bard Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Bard (Ishiir)|source=Ishiir"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Bard",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Cleric Spells",
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Cleric"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Cleric",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Druid Spells",
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Druid"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Druid",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Sorcerer Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Sorcerer"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Sorcerer",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Warlock Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Warlock"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Warlock",
                                "count": 2
                            }
                        ]
                    }
                },
                {
                    "name": "Wizard Spells",
                    "ability": "int",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Wizard"
                                    }
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Wizard",
                                "count": 2
                            }
                        ]
                    }
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose a class: {@filter bard|spells|level=0;1|class=bard (Ishiir)|source=Ishiir}, {@filter cleric|spells|level=0;1|class=cleric (Ishiir)|source=Ishiir}, {@filter druid|spells|level=0;1|class=druid (Ishiir)|source=Ishiir}, {@filter sorcerer|spells|level=0;1|class=sorcerer (Ishiir)|source=Ishiir}, {@filter warlock|spells|level=0;1|class=warlock (Ishiir)|source=Ishiir}, or {@filter wizard|spells|level=0;1|class=wizard (Ishiir)|source=Ishiir}. You learn two cantrips of your choice from that class's spell list.",
                        "In addition, choose one 1st-level spell from that same list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a {@variantrule Long Rest|Ishiir} before you can cast it again using this feat.",
                        "Your spellcasting ability for these spells is Intelligence, Wisdom, or Charisma (your choice)."
                    ]
                }
            ]
        },
        {
            "name": "Martial Adept",
            "page": 1,
            "source": "Ishiir",
            "optionalfeatureProgression": [
                {
                    "name": "Maneuvers",
                    "featureType": [
                        "MV:B"
                    ],
                    "progression": {
                        "*": 2
                    }
                }
            ],
            "entries": [
                "You have martial training that allows you to perform special combat maneuvers. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn two {@filter maneuvers|optionalfeatures|feature type=MV:B|source=Ishiir} of your choice from among those available to the {@class fighter|Ishiir|Battle Master|Battle Master|Ishiir|2-0} archetype in the fighter class. If a maneuver you use requires your target to make a {@variantrule Saving Throw|Ishiir} to resist the maneuver's effects, the {@variantrule Saving Throw|Ishiir} DC equals 8 + your {@variantrule Proficiency|Ishiir} bonus + your Strength or Dexterity modifier (your choice).",
                        "You gain two superiority die, which is a {@dice d6} (this dice are added to any superiority dice you have from another source). These dice are used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}.",
                        "When you reach level 10, the size of these dice increases to a {@dice d8}."
                    ]
                }
            ]
        },
        {
            "name": "Master of Disguise",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "cha": 1
                }
            ],
            "toolProficiencies": [
                {
                    "disguise kit": true
                }
            ],
            "entries": [
                "You have honed your ability to shape your personality and to read the personalities of others. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with the {@item disguise kit|phb}. If you are already proficient with it, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "If you spend 1 hour observing a creature, you can then spend 8 hours crafting a disguise you can quickly don to mimic that creature. Making the disguise requires a {@item disguise kit|PHB}. You must make checks as normal to disguise yourself, but you can assume the disguise as an action."
                    ]
                }
            ]
        },
        {
            "name": "Master Tinkerer",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "gnome",
                            "subrace": "Rock"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you make a crafting skill check with the {@item Tinker's Tools|Ishiir}, you only expend half the materials upon rolling three failures, and you expend no materials on any other failure.",
                        "Items you craft using {@item Tinker's Tools|Ishiir} or {@item Alchemist's Supplies|Ishiir} receive the Masterwork property even if you only roll two successes for the crafting check. If you roll three successes, they receive the bonus of the Masterwork property twice (e.g. a potion that normally lasts 1 hour, lasts 2 hours with 2 successful crafting rolls, and 3 with three successful rolls).",
                        "Additionally you may research or try to craft new devices by rolling three intelligence skill checks. The possibilities are determined only by the audacity of your ideas and the DM."
                    ]
                }
            ]
        },
        {
            "name": "Medic",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "wis": 1
                }
            ],
            "skillProficiencies": [
                {
                    "medicine": true
                }
            ],
            "entries": [
                "You master the physician's arts, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Medicine} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "During a {@variantrule Short Rest|Ishiir} or {@variantrule Long Rest|Ishiir}, you can clean and bind the wounds of up to six creatures. If the creature spends hit dice, it can maximize the result of a number of rolls equal to half your {@variantrule Proficiency|Ishiir} modifier (rounded down)."
                    ]
                }
            ]
        },
        {
            "name": "Medium Armor Master",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "proficiency": [
                        {
                            "armor": "medium"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You have practiced moving in medium armor to gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Wearing medium armor doesn't impose {@variantrule Disadvantage|Ishiir} on your Dexterity ({@skill Stealth}) checks.",
                        "When you wear medium armor, you can increase the Dexterity bonus you can add to your AC by 1."
                    ]
                }
            ]
        },
        {
            "name": "Menacing",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "cha": 1
                }
            ],
            "skillProficiencies": [
                {
                    "intimidation": true
                }
            ],
            "entries": [
                "You become fearsome to others, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Intimidation} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "When you take the {@action Attack|Ishiir} action on your turn, you can replace one attack with an attempt to demoralize one creature you can see within 30 feet of you that can see and hear you. Make a Charisma ({@skill Intimidation}) check contested by the target's Wisdom ({@skill Insight}) check. If the target creature is more than one size category larger than you, your check automatically fails. If your check succeeds, the target is {@condition Frightened|Ishiir} until the end of your next turn. If your check fails, the target can't be {@condition Frightened|Ishiir} by you in this way for 1 hour."
                    ]
                }
            ]
        },
        {
            "name": "Metamagic",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "spellcasting": true
                }
            ],
            "optionalfeatureProgression": [
                {
                    "name": "Metamagic",
                    "featureType": [
                        "MM"
                    ],
                    "progression": {
                        "*": 2
                    }
                }
            ],
            "entries": [
                "You have mastered techniques that allow you to alter or enhance spells on the fly, as you cast them.",
                {
                    "type": "list",
                    "items": [
                        "You have a number of sorcery points equal to your {@variantrule Proficiency|Ishiir} bonus, as the sorcerer class feature. You regain these points when you finish a {@variantrule Long Rest|Ishiir}. Note that you do not gain the sorcerer's Flexible Casting feature, and cannot convert spell slots to sorcery points or vice-versa unless you have that feature through other means.",
                        "You learn two {@filter Metamagic|optionalfeatures|Feature Type=MM|source=Ishiir} techniques from among those available to sorcerers at 3rd level."
                    ]
                }
            ]
        },
        {
            "name": "Mind Speech",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You gain {@language telepathy|Ishiir} with a range of 60 feet."
                    ]
                }
            ]
        },
        {
            "name": "Mobile",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You are exceptionally speedy and agile. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Your {@variantrule Speed|Ishiir} antrule Speed|Ishiir} increases by 10 feet.",
                        "When you use the {@action Dash|Ishiir} action, {@quickref difficult terrain||3} doesn't cost you extra movement on that turn.",
                        "When you make a melee attack against a creature, you don't provoke {@action opportunity attack|Ishiir}s from that creature for the rest of the turn, whether you hit or not."
                    ]
                }
            ]
        },
        {
            "name": "Moderately Armored",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "armorProficiencies": [
                {
                    "medium": true,
                    "shield|phb": true
                }
            ],
            "entries": [
                "You have trained to master the use of medium armor and shields, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with medium armor and shields."
                    ]
                }
            ]
        },
        {
            "name": "Mounted Combatant",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You are a dangerous foe to face while mounted. While you are mounted and aren't {@condition Incapacitated|Ishiir}, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on melee {@variantrule Attack Roll|Ishiir}s against any unmounted creature that is smaller than your mount.",
                        "You can force an attack targeted at your mount to target you instead.",
                        "If your mount is subjected to an effect that allows it to make a Dexterity {@variantrule Saving Throw|Ishiir} to take only half damage, it instead takes no damage if it succeeds on the {@variantrule Saving Throw|Ishiir}, and only half damage if it fails."
                    ]
                }
            ]
        },
        {
            "name": "Myst Seer",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "human",
                            "subrace": "Mystgardian"
                        }
                    ]
                }
            ],
            "additionalSpells": [
                {
                    "known": {
                        "_": [
                            "guidance|Ishiir#c",
                            "augury|Ishiir",
                            {
                                "daily": {
                                    "1": [
                                        "augury|Ishiir"
                                    ]
                                }
                            }
                        ]
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You learn the {@spell Guidance|Ishiir} cantrip. You also learn the {@spell Augury|Ishiir} spell, which you can cast once without material components. You can't cast {@spell Augury|Ishiir} again in this manner until you finish a {@variantrule Long Rest|Ishiir}.",
                        "You gain {@sense darkvision} up to a distance of 30 ft. You ignore heavy obscurement caused by fog and rain up to the same distance.",
                        "As a reaction, when you or an ally that you can see within 30 feet of you suffers a critical hit, you can turn that attack into a normal hit. Any effects triggered by a critical hit are canceled. You can use this feature a number of times equal to half your {@variantrule Proficiency|Ishiir} modifier (rounded down). You regain all expended uses on a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Mystic Adept",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "spellcasting": true
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose one class that you belong to that gives you the Spellcasting feature but not the Ritual Casting feature. You gain the ability to cast spells belonging to that class as rituals, if they have the ritual tag. You must know the spell, or (if you prepare spells) have it prepared to cast it as a ritual.",
                        "For each level of spell that you can cast as a member of this class, choose one spell of that level or lower that has the ritual tag. This spell is always prepared, if you prepare spells, or is added to your spell list, if you don't. When you gain a new level of spellcasting as a member of your chosen class, you gain another such spell. These additional spells are not restricted by school, even if your normal spell selections are."
                    ]
                }
            ]
        },
        {
            "name": "Naturalist",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "int": 1
                }
            ],
            "skillProficiencies": [
                {
                    "nature": true
                }
            ],
            "additionalSpells": [
                {
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    "detect poison and disease|Ishiir"
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            "druidcraft|Ishiir#c"
                        ]
                    }
                }
            ],
            "entries": [
                "Your extensive study of nature rewards you with the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Nature} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You learn the {@spell druidcraft|Ishiir} and {@spell detect poison and disease|Ishiir} spells. You can cast {@spell detect poison and disease|Ishiir} once without expending a spell slot, and you regain the ability to do so when you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Nature's Embrace",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Druid",
                            "visible": true
                        }
                    }
                }
            ],
            "skillProficiencies": [
                {
                    "survival": true,
                    "nature": true,
                    "animal handling": true
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose Survival, Nature, or Animal Handling. You gain {@variantrule Proficiency|Ishiir} in the chosen skill. If you are already proficient in the skill, your {@variantrule Proficiency|Ishiir} bonus is doubled for checks you make with it.",
                        "When you and your companions recover hit dice after a rest in a natural environment, you can add your {@variantrule Proficiency|Ishiir} bonus to the number of hit dice regained in this manner. The total number of hit dice cannot exceed the maximum for each character.",
                        "When you or a creature within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant {@variantrule Resistance|Ishiir} to the creature against that instance of the damage."
                    ]
                }
            ]
        },
        {
            "name": "Net Master",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You have practiced using the net in combat until you are able to use it with startling effectiveness.",
                {
                    "type": "list",
                    "items": [
                        "You do not gain {@variantrule Disadvantage|Ishiir} for making a ranged attack with a net while within 5 feet of a hostile creature.",
                        "When a creature within five feet of you makes a Strength check to attempt to remove a net, you may make an {@action opportunity attack|Ishiir} against them as a reaction.",
                        "When a creature within five feet of you is caught in a net, you may make a {@action shove|Ishiir} attempt against them as a bonus action."
                    ]
                }
            ]
        },
        {
            "name": "New Beginning",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex",
                            "con",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You have had a change in your life situation, such as discovering you are the heir to a noble title or joining a religious order.",
                {
                    "type": "list",
                    "items": [
                        "Choose one background other than the one you already have. You gain one skill {@variantrule Proficiency|Ishiir}, one language or tool {@variantrule Proficiency|Ishiir}, and the feature granted by that background. You may change a characteristic (such as a bond or ideal) to match your new station and changed outlook. The DM may require you to spend some downtime adjusting to your new situation before you can gain the benefits of this feat."
                    ]
                }
            ]
        },
        {
            "name": "Nimble Feet",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "halfling",
                            "subrace": "Lightfoot"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Your {@variantrule Speed|Ishiir} antrule Speed|Ishiir} increases by 5 ft.",
                        "The spaces of other creatures that are at least one size larger than you no longer count as difficult terrain for you and you can move through spaces occupied by hostile creatures.",
                        "If you are subject to an effect that requires you to make a STR {@variantrule Saving Throw|Ishiir} or a STR check, you can make a DEX {@variantrule Saving Throw|Ishiir} or DEX check instead, respectively."
                    ]
                }
            ]
        },
        {
            "name": "Observant",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis"
                        ],
                        "amount": 1
                    }
                }
            ],
            "skillProficiencies": [
                {
                    "perception": true,
                    "investigation": true
                }
            ],
            "entries": [
                "Quick to notice details of your environment, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in Wisdom ({@skill Perception}) or Intelligence ({@skill Investigation}) checks. If you already have {@variantrule Proficiency|Ishiir} in the chosen skill, you double your {@variantrule Proficiency|Ishiir} for all checks with it.",
                        "If you can see a creature's mouth while it is speaking a language you understand, you can interpret what it's saying by reading its lips."
                    ]
                }
            ]
        },
        {
            "name": "Oracle",
            "page": 1,
            "source": "Ishiir",
            "additionalSpells": [
                {
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    "augury|Ishiir",
                                    "divination|Ishiir",
                                    "commune|Ishiir",
                                    "commune with nature|Ishiir",
                                    "contact other plane|Ishiir"
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "You are in touch with a higher plane or supernatural forces, allowing you to cast certain spells as a ritual.",
                {
                    "type": "list",
                    "items": [
                        "They are {@spell augury|Ishiir}, {@spell divination|Ishiir}, and one of the following: {@spell commune|Ishiir}, {@spell commune with nature|Ishiir}, {@spell contact other plane|Ishiir}. Make the choice when you gain this feat. Your spellcasting ability with these spells is Intelligence, Wisdom, or Charisma (your choice). You may cast each of these spells once, and you can do so without any material components. You regain your use of all of them when you complete a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Orcish Fury",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "orc"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "con"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Your fury burns tirelessly. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you hit with an attack using a simple or martial weapon, you can roll the weapon's damage dice an additional time and add it as extra damage of the weapon's damage type. Once you use this ability, you can't use it again until you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}.",
                        "Immediately after you use your Relentless Endurance trait, you can use your reaction to make one weapon attack."
                    ]
                }
            ]
        },
        {
            "name": "Pact Initiate",
            "page": 1,
            "source": "Ishiir",
            "additionalSpells": [
                {
                    "name": "Warlock Spells",
                    "ability": "cha",
                    "known": {
                        "_": [
                            {
                                "choose": "level=1|class=Warlock (Ishiir)|spell attack=m;r;o|source=Ishiir",
                                "count": 1
                            }
                        ]
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose an otherworldly patron, if you don't already have one. You gain the 1st level features granted by this patron. If any of the features gained in this manner reference your warlock level, you can use your highest class level instead.",
                        "You learn one of the 1st level spells from the list of spells granted by your otherworldly patron. Charisma is your spellcasting ability for this spell, which is considered a warlock spell. You can cast this spell once as a 1st level spell without using a slot, after which you must complete a {@variantrule Short Rest|Ishiir} before you can do so again."
                    ]
                }
            ]
        },
        {
            "name": "Path to the Ninth Gate",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Monk",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Your Martial Arts die increases by one size and your maximum number of Ki point increases by an amount equal to your {@variantrule Proficiency|Ishiir} modifier.",
                        "Additionally, when you spend a Ki point to use a monk class feature as a bonus action that is not Flurry of Blows, you may spend an additional ki point to make a single unarmed attack or weapon attack with a monk weapon as part of the same bonus action."
                    ]
                }
            ]
        },
        {
            "name": "Patron's Favorite",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Warlock",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You gain an additional invocation.",
                        "When you start your turn without any Pact Magic spell slots remaining, you can choose to regain one Pact Magic spell slot. You can use this feature once and can't use it again until you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Perceptive",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "wis": 1
                }
            ],
            "skillProficiencies": [
                {
                    "perception": true
                }
            ],
            "entries": [
                "You hone your senses until they become razor sharp. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Perception} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "Being in a lightly obscured area doesn't impose {@variantrule Disadvantage|Ishiir} on your Wisdom ({@skill Perception}) checks if you can both see and hear."
                    ]
                }
            ]
        },
        {
            "name": "Performer",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "cha": 1
                }
            ],
            "skillProficiencies": [
                {
                    "performance": true
                }
            ],
            "entries": [
                "You master performance so that you can command any stage. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Performance} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "While performing, you can try to distract one humanoid you can see who can see and hear you. Make a Charisma ({@skill Performance}) check contested by the humanoid's Wisdom ({@skill Insight}) check. If your check succeeds, you grab the humanoid's attention enough that it makes Wisdom ({@skill Perception}) and Intelligence ({@skill Investigation}) checks with {@variantrule Disadvantage|Ishiir} until you stop performing."
                    ]
                }
            ]
        },
        {
            "name": "Piercer",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You have achieved a penetrating precision in combat, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Once per turn, when you hit a creature with an attack that deals piercing damage, you can reroll one of the attack's damage dice, and you must use the new roll.",
                        "When you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes."
                    ]
                }
            ]
        },
        {
            "name": "Poisoner",
            "page": 1,
            "source": "Ishiir",
            "toolProficiencies": [
                {
                    "poisoner's kit": true
                }
            ],
            "entries": [
                "You can prepare and deliver deadly poisons, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you make a damage roll that deals poison damage, it ignores {@variantrule Resistance|Ishiir} to poison damage.",
                        "You can apply poison to a weapon or piece of ammunition as a bonus action, instead of an action.",
                        "You gain {@variantrule Proficiency|Ishiir} with the {@item poisoner's kit|Ishiir}. If you already proficient, you double your {@variantrule Proficiency|Ishiir} bonus for any check you make with it. With one hour of work using a {@item poisoner's kit|Ishiir} and expending 50 gp worth of materials, you can create a number of doses of potent poison equal to your {@variantrule Proficiency|Ishiir} bonus. Once applied to a weapon or piece of ammunition, the poison retains its potency for 1 minute or until you hit with the weapon or ammunition. When a creature takes damage from the coated weapon or ammunition, that creature must succeed on a DC 14 Constitution {@variantrule Saving Throw|Ishiir} or take {@damage 2d8} poison damage and become poisoned until the end of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Polearm Master",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You can keep your enemies at bay with reach weapons. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you take the {@action Attack|Ishiir} action and attack with only an {@item elvish spear|Ishiir}, {@item faunish spear|Ishiir}, {@item glaive|Ishiir}, {@item greatspear|Ishiir}, {@item halberd|Ishiir}, {@item quarterstaff|Ishiir}, {@item spear|Ishiir}, or {@item trident|Ishiir} using two hands, you can use a bonus action to make a melee attack with the opposite end of the weapon; this attack uses the same ability modifier as the primary attack. The weapon's damage die for this attack is a {@dice d4}, and the attack deals bludgeoning damage.",
                        "While you are wielding any of the above weapons, other creatures provoke an opportunity attack from you when they enter your reach."
                    ]
                }
            ]
        },
        {
            "name": "Powerful Build",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "str": 1
                }
            ],
            "entries": [
                "You are incredibly physically powerful.",
                {
                    "type": "list",
                    "items": [
                        "You are considered one size larger for purposes of lifting and carrying weight, as well as for grappling and shoving (whether you are the one doing it or the one it's being done to), escaping from nets, or any effect that creatures gain {@variantrule Advantage|Ishiir} against or {@variantrule Immunity|Ishiir} to based on being at least a certain size."
                    ]
                }
            ]
        },
        {
            "name": "Prodigy",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "half-elf"
                        },
                        {
                            "name": "Nessian"
                        },
                        {
                            "name": "Human"
                        }
                    ]
                }
            ],
            "skillProficiencies": [
                {
                    "choose": {
                        "from": [
                            "athletics",
                            "acrobatics",
                            "sleight of hand",
                            "stealth",
                            "arcana",
                            "history",
                            "investigation",
                            "nature",
                            "religion",
                            "animal handling",
                            "insight",
                            "medicine",
                            "perception",
                            "survival",
                            "deception",
                            "intimidation",
                            "performance",
                            "persuasion"
                        ]
                    }
                }
            ],
            "languageProficiencies": [
                {
                    "any": 1
                }
            ],
            "expertise": [
                {
                    "anyProficientSkill": 1
                }
            ],
            "toolProficiencies": [
                {
                    "any": 1
                }
            ],
            "entries": [
                "You have a knack for learning new things. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain one {@table skills|phb|skill proficiency} of your choice, one {@filter tool proficiency|items|type=tool;artisan's tools} of your choice, and fluency in one language of your choice.",
                        "Choose one skill in which you have {@variantrule Proficiency|Ishiir}. You gain expertise with that skill, which means your {@variantrule Proficiency|Ishiir} bonus is doubled for any {@variantrule Ability Check|Ishiir} you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your {@variantrule Proficiency|Ishiir} bonus."
                    ]
                }
            ]
        },
        {
            "name": "Quick Draw",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "dex": 1
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "After rolling for initiative but before the first turn of combat, you may draw one weapon (if necessary) and make a single weapon attack with it. If multiple creatures are present who have the ability to act before initiative begins, these actions resolve in initiative order.",
                        "When you make a weapon attack, you may stow one weapon and draw one weapon as part of the action, bonus action, or reaction, in any order necessary. E.g., you could draw your sword, strike, and then sheathe it, or stow your sword draw a bow, and attack with it. Similarly, if you have multiple attacks, you could attack with one weapon, stow it, and then draw another and attack with that."
                    ]
                }
            ]
        },
        {
            "name": "Quick-Fingered",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "dex": 1
                }
            ],
            "skillProficiencies": [
                {
                    "sleight of hand": true
                }
            ],
            "entries": [
                "Your nimble fingers and agility let you perform sleight of hand. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Sleight of Hand} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "As a bonus action, you can make a Dexterity ({@skill Sleight of Hand}) check to plant something on someone else, conceal an object on a creature, lift a purse, or take something from a pocket."
                    ]
                }
            ]
        },
        {
            "name": "Resilient",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex",
                            "con",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1,
                        "entry": "Increase the chosen ability score by 1, to a maximum of 20."
                    }
                }
            ],
            "entries": [
                "Choose one ability score. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in {@variantrule Saving Throw|Ishiir|Saving Throws} using the chosen ability."
                    ]
                }
            ]
        },
        {
            "name": "Ritual Caster",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "ability": [
                        {
                            "int": 13
                        },
                        {
                            "wis": 13
                        },
                        {
                            "cha": 13
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "additionalSpells": [
                {
                    "name": "Bard Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Bard (Ishiir)|components & miscellaneous=ritual|source=Ishiir",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Cleric Spells",
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Cleric (Ishiir)|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Druid Spells",
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Druid (Ishiir)|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Sorcerer Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Sorcerer (Ishiir)|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Warlock Spells",
                    "ability": "cha",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Warlock (Ishiir)|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                },
                {
                    "name": "Wizard Spells",
                    "ability": "int",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    {
                                        "choose": "level=1|class=Wizard (Ishiir)|components & miscellaneous=ritual",
                                        "count": 2
                                    }
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.",
                        {
                            "type": "list",
                            "items": [
                                "When you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following classes: {@filter bard|spells|level=1|class=bard (Ishiir)|components & miscellaneous=ritual|source=Ishiir}, {@filter cleric|spells|level=1|class=cleric (Ishiir)|components & miscellaneous=ritual|source=Ishiir}, {@filter druid|spells|level=1|class=druid (Ishiir)|components & miscellaneous=ritual|source=Ishiir}, {@filter sorcerer|spells|level=1|class=sorcerer (Ishiir)|components & miscellaneous=ritual|source=Ishiir}, {@filter warlock|spells|level=1|class=warlock (Ishiir)|components & miscellaneous=ritual|source=Ishiir}, or {@filter wizard|spells|level=1|class=wizard (Ishiir)|components & miscellaneous=ritual|source=Ishiir}. You must choose your spells from that class's spell list, and the spells you choose must have the ritual tag. The class you choose also determines your spellcasting ability for these spells: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.",
                                "If you come across a spell in written form, such as a magical {@item spell scroll} or a wizard's spellbook, you might be able to add it to your ritual book. The spell must be on the spell list for the class you chose, the spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Sapper",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "One-handed bludgeoning weapons have the finesse property when you wield them.",
                        "When you attack an enemy with such a weapon and you meet the criteria for using the rogue's Sneak Attack ability, you inflict an additional {@dice 1d6} damage. This stacks with the damage from Sneak Attack if you have that feature.",
                        "When you strike a surprised opponent with a weapon that qualifies for this feat, if the creature's current hit points after the attack is less than or equal to the damage the attack inflicted, they are reduced to 0 hp and rendered {@condition Unconscious|Ishiir}. This has no effect on constructs or undead."
                    ]
                }
            ]
        },
        {
            "name": "Savage Attacker",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon's damage dice and use either total."
                    ]
                }
            ]
        },
        {
            "name": "Second Chance",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "halfling"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "dex",
                            "con",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Fortune favors you when someone tries to strike you. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When a creature you can see hits you with an {@variantrule Attack Roll|Ishiir}, you can use your reaction to force that creature to reroll. Once you use this ability, you can't use it again until you roll initiative at the start of combat or until you finish a {@variantrule Short Rest|Ishiir} or a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Sentinel",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You have mastered techniques to take {@variantrule Advantage|Ishiir} of every drop in any enemy's guard, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you hit a creature with an opportunity attack, the creature's {@variantrule Speed|Ishiir} antrule Speed|Ishiir} becomes 0 for the rest of the turn.",
                        "Creatures provoke opportunity attacks from you even if they take the {@action Disengage|Ishiir} action before leaving your reach.",
                        "When a creature within reach of a melee weapon you are wielding makes an attack against a target other than you, you can use your reaction to make a melee weapon attack with that weapon against the attacking creature."
                    ]
                }
            ]
        },
        {
            "name": "Shadow Touched",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "additionalSpells": [
                {
                    "ability": "inherit",
                    "innate": {
                        "_": {
                            "daily": {
                                "1e": [
                                    "invisibility",
                                    {
                                        "choose": "level=1|school=I;N|source=Ishiir"
                                    }
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "Your exposure to the Shadowfell's magic has changed you, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn the {@spell invisibility|Ishiir} spell and one {@filter 1st-level spell|spells|level=1|school=I;N|source=Ishiir} of your choice. The {@filter 1st-level spell|spells|level=1|school=I;N|source=Ishiir} must be from the illusion or necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a {@variantrule Long Rest|Ishiir}. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat."
                    ]
                }
            ]
        },
        {
            "name": "Sharpshooter",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Attacking at long range doesn't impose {@variantrule Disadvantage|Ishiir} on your ranged weapon {@variantrule Attack Roll|Ishiir}s.",
                        "Your ranged weapon attacks ignore half cover and three-quarters cover.",
                        "Before you make an attack with a ranged weapon that you are proficient with, you can choose to take a -5 penalty to the {@variantrule Attack Roll|Ishiir}. If the attack hits, you add +10 to the attack's damage."
                    ]
                }
            ]
        },
        {
            "name": "Shield Master",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "otherSummary": {
                        "entry": "{@variantrule Proficiency|Ishiir} with shields.",
                        "entrySummary": "Prof shields"
                    }
                }
            ],
            "entries": [
                "You use shields not just for protection but also for offense. You gain the following benefits while you are wielding a {@item shield|Ishiir}:",
                {
                    "type": "list",
                    "items": [
                        "If you take the {@action Attack|Ishiir} action on your turn, you can use a bonus action to try to {@action shove|Ishiir} a creature within 5 feet of you with your shield.",
                        "If you aren't {@condition Incapacitated|Ishiir}, you can add your shield's AC bonus to any Dexterity {@variantrule Saving Throw|Ishiir} you make against a spell or other harmful effect that targets only you.",
                        "If you are subjected to an effect that allows you to make a Dexterity {@variantrule Saving Throw|Ishiir} to take only half damage, you can use your reaction to take no damage if you succeed on the {@variantrule Saving Throw|Ishiir}, interposing your shield between yourself and the source of the effect."
                    ]
                }
            ]
        },
        {
            "name": "Silver-Tongued",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "cha": 1
                }
            ],
            "skillProficiencies": [
                {
                    "deception": true
                }
            ],
            "entries": [
                "You develop your conversational skill to better deceive others. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Deception} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "When you take the {@action Attack|Ishiir} action on your turn, you can replace one attack with an attempt to deceive one creature you can see within 30 feet of you that can see and hear you. Make a Charisma ({@skill Deception}) check contested by the target's Wisdom ({@skill Insight}) check. If the target creature's Intelligence is 6 or lower, this feature has no effect. If your check succeeds, your movement doesn't provoke opportunity attacks from the target and your {@variantrule Attack Roll|Ishiir}s against it have {@variantrule Advantage|Ishiir}; both benefits last until the end of your next turn or until you use this ability on a different target. If your check fails, the target can't be deceived by you in this way for 1 hour."
                    ]
                }
            ]
        },
        {
            "name": "Skilled",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex",
                            "con",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "skillToolLanguageProficiencies": [
                {
                    "choose": [
                        {
                            "from": [
                                "anySkill",
                                "anyTool"
                            ],
                            "count": 3
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in any combination of three {@table skills|phb} or {@filter tools|items|type=tools;artisan's tools;instrument;gaming set;vehicle (land);vehicle (water)} of your choice."
                    ]
                }
            ]
        },
        {
            "name": "Skulker",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "ability": [
                        {
                            "dex": 13
                        }
                    ]
                }
            ],
            "entries": [
                "You are expert at slinking through shadows. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You can try to hide when you are lightly obscured from the creature from which you are hiding.",
                        "When you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.",
                        "Dim light doesn't impose {@variantrule Disadvantage|Ishiir} on your Wisdom ({@skill Perception}) checks relying on sight."
                    ]
                }
            ]
        },
        {
            "name": "Slasher",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You've learned where to cut to have the greatest results, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Once per turn when you hit a creature with an attack that deals slashing damage, you can reduce the {@variantrule Speed|Ishiir} antrule Speed|Ishiir} of the target by 10 feet until the start of your next turn.",
                        "When you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has {@variantrule Disadvantage|Ishiir} on all {@variantrule Attack Roll|Ishiir}s."
                    ]
                }
            ]
        },
        {
            "name": "Slayer",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "You are supernaturally well suited to hunt and slay a certain type of creatures, such as the undead. This gives you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain one type of favored enemy, as per the ranger feature. Your weapon attacks against your favored enemies are considered magical for purposes of damage {@variantrule Resistance|Ishiir} or {@variantrule Immunity|Ishiir}.",
                        "Once you reach character level 6, you gain the benefits of the Greater Favored Enemy class feature for the type of favored enemy chosen for this feat."
                    ]
                }
            ]
        },
        {
            "name": "Spell Sniper",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "spellcasting": true
                }
            ],
            "additionalSpells": [
                {
                    "name": "Bard Spells",
                    "ability": "cha",
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Bard (Ishiir)|spell attack=m;r;o|source=Ishiir",
                                "count": 1
                            }
                        ]
                    }
                },
                {
                    "name": "Cleric Spells",
                    "ability": "wis",
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Cleric (Ishiir)|spell attack=m;r;o",
                                "count": 1
                            }
                        ]
                    }
                },
                {
                    "name": "Druid Spells",
                    "ability": "wis",
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Druid (Ishiir)|spell attack=m;r;o",
                                "count": 1
                            }
                        ]
                    }
                },
                {
                    "name": "Sorcerer Spells",
                    "ability": "cha",
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Sorcerer (Ishiir)|spell attack=m;r;o",
                                "count": 1
                            }
                        ]
                    }
                },
                {
                    "name": "Warlock Spells",
                    "ability": "cha",
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Warlock (Ishiir)|spell attack=m;r;o",
                                "count": 1
                            }
                        ]
                    }
                },
                {
                    "name": "Wizard Spells",
                    "ability": "int",
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Wizard (Ishiir)|spell attack=m;r;o",
                                "count": 1
                            }
                        ]
                    }
                }
            ],
            "entries": [
                "You have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you cast a spell that requires you to make an {@variantrule Attack Roll|Ishiir}, the spell's range is doubled.",
                        "Your ranged spell attacks ignore half cover and three-quarters cover.",
                        "You learn one cantrip that requires an {@variantrule Attack Roll|Ishiir}. Choose the cantrip from the {@filter bard|spells|level=0|class=bard (Ishiir)|spell attack=m;r;o|source=Ishiir}, {@filter cleric|spells|level=0|class=cleric (Ishiir)|spell attack=m;r;o|source=Ishiir}, {@filter druid|spells|level=0|class=druid (Ishiir)|spell attack=m;r;o|source=Ishiir}, {@filter sorcerer|spells|level=0|class=sorcerer (Ishiir)|spell attack=m;r;o|source=Ishiir}, {@filter warlock|spells|level=0|class=warlock (Ishiir)|spell attack=m;r;o|source=Ishiir}, or {@filter wizard|spells|level=0|class=wizard (Ishiir)|spell attack=m;r;o|source=Ishiir} spell list. Your spellcasting ability for this cantrip is Intelligence, Wisdom, or Charisma (your choice)."
                    ]
                }
            ]
        },
        {
            "name": "Squat Nimbleness",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "dwarf"
                        },
                        {
                            "name": "small race",
                            "displayEntry": "a Small race"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "skillProficiencies": [
                {
                    "choose": {
                        "from": [
                            "acrobatics",
                            "athletics"
                        ]
                    }
                }
            ],
            "entries": [
                "You are uncommonly nimble for your race. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "Increase your {@variantrule Speed|Ishiir} by 5 feet.",
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Acrobatics} or {@skill Athletics} skill (your choice).",
                        "You have {@variantrule Advantage|Ishiir} on any Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check you make to escape from being {@condition Grappled|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Stealthy",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "dex": 1
                }
            ],
            "skillProficiencies": [
                {
                    "stealth": true
                }
            ],
            "entries": [
                "You know how best to hide. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Stealth} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "If you are hidden, you can move up to 10 feet in the open without revealing yourself if you end the move in a position where you're not clearly visible."
                    ]
                }
            ]
        },
        {
            "name": "Supernatural Constitution",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "nessian"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "con": 1
                }
            ],
            "entries": [
                "Arcane energy runs strong in your blood, unlocking a resilience akin to that possessed by some supernatural entities. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Resistance|Ishiir} to cold and poison damage.",
                        "You have {@variantrule Advantage|Ishiir} on {@variantrule Saving Throw|Ishiir|Saving Throws} against being {@condition Poisoned|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Survivalist",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "wis": 1
                }
            ],
            "skillProficiencies": [
                {
                    "survival": true
                }
            ],
            "additionalSpells": [
                {
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    "alarm|Ishiir"
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "You master wilderness lore, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Survival} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You learn the {@spell alarm|Ishiir} spell. You can cast it once without expending a spell slot, and you regain the ability to do so when you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Sylvan Lineage",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "elf",
                            "subrace": "High"
                        }
                    ]
                }
            ],
            "skillProficiencies": [
                {
                    "persuasion": true,
                    "intimidation": true
                }
            ],
            "entries": [
                "Arcane energy runs strong in your blood, unlocking a resilience akin to that possessed by some supernatural entities. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Persuasion} or {@skill Intimidation} skill (your choice). If you already have {@variantrule Proficiency|Ishiir} in the chosen skill, your {@variantrule Proficiency|Ishiir} bonus is doubled for any check you make with it.",
                        "As a bonus action, you can teleport up to 30 feet to an unoccupied square that you can see. Once you use this ability, you can't use it again until you finish a {@variantrule Long Rest|Ishiir}.",
                        "You have {@variantrule Advantage|Ishiir} on Wisdom {@variantrule Saving Throw|Ishiir|Saving Throws} against magic."
                    ]
                }
            ]
        },
        {
            "name": "Tandem Tactician",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Your presence in a scrap tends to elevate your comrades. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You can use the {@action Help|Ishiir} action as a bonus action.",
                        "When you use the {@action Help|Ishiir} action to aid an ally in attacking a creature, increase the range of the {@action Help|Ishiir} action by 10 feet. Additionally, you can help two allies targeting the same creature within range when you use the {@action Help|Ishiir} action this way."
                    ]
                }
            ]
        },
        {
            "name": "Tavern Brawler",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "con"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                "Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You are proficient with improvised weapons.",
                        "Your unarmed strike uses a {@damage d4} for damage.",
                        "When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target."
                    ]
                }
            ]
        },
        {
            "name": "Telekinetic",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "additionalSpells": [
                {
                    "ability": "inherit",
                    "known": {
                        "_": [
                            "mage hand|Ishiir#c"
                        ]
                    }
                }
            ],
            "entries": [
                "You learn to move things with your mind, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You learn the {@spell mage hand|Ishiir} cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand {@condition Invisible|Ishiir}. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat.",
                        "As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength {@variantrule Saving Throw|Ishiir} (DC 8 + your {@variantrule Proficiency|Ishiir} bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward you or away from you. A creature can willingly fail this save."
                    ]
                }
            ]
        },
        {
            "name": "Telepathic",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "additionalSpells": [
                {
                    "ability": "inherit",
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    "detect thoughts|Ishiir"
                                ]
                            }
                        }
                    }
                }
            ],
            "entries": [
                "You awaken the ability to mentally connect with others, granting you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You can speak telepathically to any creature you can see within 60 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.",
                        "You can cast the {@spell detect thoughts|Ishiir} spell, requiring no spell slot or components, and you must finish a {@variantrule Long Rest|Ishiir} before you can cast it this way again. Your spellcasting ability for the spell is the ability increased by this feat. If you have spell slots of 2nd level or higher, you can cast this spell with them."
                    ]
                }
            ]
        },
        {
            "name": "Theologian",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "int": 1
                }
            ],
            "skillProficiencies": [
                {
                    "religion": true
                }
            ],
            "additionalSpells": [
                {
                    "innate": {
                        "_": {
                            "daily": {
                                "1": [
                                    "detect evil and good|Ishiir"
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            "thaumaturgy#c"
                        ]
                    }
                }
            ],
            "entries": [
                "Your extensive study of religion rewards you with the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} in the {@skill Religion} skill. If you are already proficient in the skill, you add double your {@variantrule Proficiency|Ishiir} bonus to checks you make with it.",
                        "You learn the {@spell thaumaturgy|Ishiir} and {@spell detect evil and good|Ishiir} spells. You can cast {@spell detect evil and good|Ishiir} once without expending a spell slot, and you regain the ability to do so when you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Tough",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points."
                    ]
                }
            ]
        },
        {
            "name": "Tricks of the Trade",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Rogue",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Your Cunning Action choices gain the following additional benefits:",
                        {
                            "type": "list",
                            "items": [
                                {
                                    "type": "list",
                                    "style": "list-hang-notitle",
                                    "items": [
                                        {
                                            "type": "item",
                                            "name": "Dash",
                                            "entries": [
                                                "You ignore {@quickref difficult terrain||3} for the current turn."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Disengage",
                                            "entries": [
                                                "You can move through the space of hostile creatures, treating it as {@quickref difficult terrain||3}, but you can't willingly end your turn in an occupied space. The next {@variantrule Attack Roll|Ishiir} against you before the start of your next turn has {@variantrule Disadvantage|Ishiir}."
                                            ]
                                        },
                                        {
                                            "type": "item",
                                            "name": "Hide",
                                            "entries": [
                                                "If you hide successfully, you can also spend a hit die as if you had taken a rest, regaining hit points as normal."
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        "If you use your Sneak Attack feature on a creature that is suffering from one or more conditions that allow it to repeat the {@variantrule Saving Throw|Ishiir} at the end of its turn, it makes all {@variantrule Saving Throw|Ishiir|Saving Throws} against on-going conditions at the end of its next turn with {@variantrule Disadvantage|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Unarmed Master",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you make an unarmed strike as part of the Attack action on your turn, it inflicts an additional {@dice 1d4} damage on a hit.",
                        "Whenever you have the ability to make multiple unarmed strikes as part of the same action or bonus action, you may choose to make a single unarmed strike with {@variantrule Advantage|Ishiir} instead.",
                        "Before you make an unarmed strike, you may choose to take a -5 penalty to the {@variantrule Attack Roll|Ishiir}. If the attacks hits, you add +10 to the attack's damage."
                    ]
                }
            ]
        },
        {
            "name": "Unyielding as the Mountain",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "harfolk"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "When you use your Harfolk Hardiness racial feature, roll additional {@dice d12} equal to your {@variantrule Proficiency|Ishiir} and add them to the total. You gain the amount rolled as temporary HP, rather than reducing the incoming damage by it. These temporary HP last until the beginning of your next turn.",
                        "If you are hit by an attack or a spell that causes effects additionally to dealing damage, you are not subject to these effects as long as the damage does not exceed the number of temporary HP from this feature.",
                        "In addition, you may now use this feature outside of combat without a damage trigger. If you do so, you can decide to gain back HP equal to half the amount rolled rather than temporary HP, but not above your max HP."
                    ]
                }
            ]
        },
        {
            "name": "Venom of the Mystwood",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "elf",
                            "subrace": "Wood"
                        }
                    ]
                }
            ],
            "toolProficiencies": [
                {
                    "poisoner's kit": true
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with the {@item poisoner's kit|Ishiir} and you have {@variantrule Advantage|Ishiir} on nature checks to extract poison from natural creatures. If you already have {@variantrule Proficiency|Ishiir} in it, your {@variantrule Proficiency|Ishiir} bonus is doubled for all checks you make with it.",
                        "Surprised creatures make {@variantrule Saving Throw|Ishiir|Saving Throws} against poison-based effects and poison damage caused by you with {@variantrule Disadvantage|Ishiir}.",
                        "Poisons you use and spells cast by you that deal poison damage ignore {@variantrule Resistance|Ishiir} to poison damage."
                    ]
                }
            ]
        },
        {
            "name": "War Caster",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "spellcasting": true
                }
            ],
            "entries": [
                "You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have {@variantrule Advantage|Ishiir} on Constitution {@variantrule Saving Throw|Ishiir|Saving Throws} that you make to maintain your {@condition Concentration|Ishiir} on a spell when you take damage.",
                        "You can perform the somatic components of spells even when you have weapons or a {@item shield|Ishiir} in one or both hands.",
                        "When a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature."
                    ]
                }
            ]
        },
        {
            "name": "Way of the Bow",
            "page": 1,
            "source": "Ishiir",
            "entries": [
                "You have practiced a style of archery that relies on intuition as much as perception. This allows you to attack with fluid rapidity or with great deliberation, as the situation demands.",
                {
                    "type": "list",
                    "items": [
                        "When you take the {@action Disengage|Ishiir} or {@action Dash|Ishiir} action on your turn, you can make a single ranged weapon attack with a shortbow or longbow as a bonus action.",
                        "When an ally takes the {@action Help|Ishiir} action to give you {@variantrule Advantage|Ishiir} on an attack against another creature, you can make a ranged weapon attack using a shortbow or longbow against that creature as a reaction.",
                        "As a bonus action, you may aim at a creature who has less than total cover from you. This gives you {@variantrule Advantage|Ishiir} on the next ranged weapon attack you make against that creature before the end of your turn."
                    ]
                }
            ]
        },
        {
            "name": "Weapon Master",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "weaponProficiencies": [
                {
                    "martial": true
                }
            ],
            "armorProficiencies": [
                {
                    "shields": true
                }
            ],
            "entries": [
                "You have practiced extensively with a variety of weapons, gaining the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with martial weapons and shields."
                    ]
                }
            ]
        },
        {
            "name": "Weaveshaper",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Sorcerer",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Your maximum amount of Sorcery point increases by an amount equal to your {@variantrule Proficiency|Ishiir} modifier. You can choose one additional kind of Metamagic.",
                        "You also gain the following additional Metamagic options. Each of these can be combined with any other Metamagic option that you know and does not cost any sorcery points.",
                        {
                            "type": "list",
                            "items": [
                                "Shape Spell: When you cast a spell with an area of effect that is either a cone, line, circle, or square, you can change the area of effect to a different one from the aforementioned. The size of the area of effect changes depending on the shape as below, rounded down to increments of 5:",
                                {
                                    "type": "table",
                                    "colLabels": [
                                        "Shape",
                                        "To Square/Circle",
                                        "To Cone",
                                        "To Line"
                                    ],
                                    "colStyles": [
                                        "col-1 text-center",
                                        "col-1 text-center",
                                        "col-1 text-center",
                                        "col-1 text-center"
                                    ],
                                    "rows": [
                                        [
                                            "Square/Circle",
                                            "x1",
                                            "x3",
                                            "x5"
                                        ],
                                        [
                                            "Cone",
                                            "/3",
                                            "x1",
                                            "x5/3"
                                        ],
                                        [
                                            "Line",
                                            "/5",
                                            "x3/5",
                                            "x1"
                                        ]
                                    ]
                                },
                                "Shape Energy: When you cast a spell that deals damage, you can change the spell's damage type to a different one of your choice."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Wildheart",
            "page": 1,
            "source": "Ishiir",
            "critEffect": true,
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Shifter",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Your critical range for attacks with your natural weapons increases by 1.",
                        "When you have to make a {@variantrule Saving Throw|Ishiir} against being {@condition Frightened|Ishiir} or {@condition Charmed|Ishiir}, you add a bonus equal to your formshift damage bonus to it.",
                        "While formshifted, you can choose to spend a hit die at the beginning of your turn (no action required), regaining hitpoints as normal."
                    ]
                }
            ]
        },
        {
            "name": "Wood Elf Magic",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "elf",
                            "subrace": "Wood"
                        }
                    ]
                }
            ],
            "ability": [
                {
                    "wis": 1
                }
            ],
            "additionalSpells": [
                {
                    "ability": "wis",
                    "innate": {
                        "_": {
                            "daily": {
                                "1e": [
                                    "longstrider|Ishiir",
                                    "pass without trace|Ishiir"
                                ]
                            }
                        }
                    },
                    "known": {
                        "_": [
                            {
                                "choose": "level=0|class=Druid (Ishiir)|source=Ishiir"
                            }
                        ]
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You learn the magic of the primeval woods, which are revered and protected by your people. You learn one druid cantrip of your choice. You also learn the {@spell longstrider|Ishiir} and {@spell pass without trace|Ishiir} spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a {@variantrule Long Rest|Ishiir}. Wisdom is your spellcasting ability for all three spells."
                    ]
                }
            ]
        },
        {
            "name": "Mercurial Form",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "Changeling"
                        }
                    ]
                }
            ],
            "entries": [
                "You can use your Shapechanger racial features as a bonus action. Any time you shapechange, you may pick a number of the following benefits equal to half your {@variantrule Proficiency|Ishiir} modifier (rounded up):",
                {
                    "type": "list",
                    "items": [
                        "You can exchange one physical ability score (STR, DEX, CON) for another of yours. You only exchange the base value, not including any bonuses from items, spells, or other effects.",
                        "You can exchange one skill {@variantrule Proficiency|Ishiir} for another. You may take this benefit multiple times, up to the maximum granted by this feat.",
                        "You gain a {@variantrule Swim Speed|Ishiir} equal to your {@variantrule Speed|Ishiir}.",
                        "You gain a {@variantrule Climb Speed|Ishiir} equal to your {@variantrule Speed|Ishiir}.",
                        "Your {@variantrule Speed|Ishiir} increases by 10 feet.",
                        "When you jump, the distance you can cover is tripled.",
                        "Your reach increases by 5 feet.",
                        "You can breathe normally underwater.",
                        "You become acclimatized to extreme cold or heat.",
                        "Your {@sense darkvision} range increases by 60 feet.",
                        "You gain the Spider Climb monster trait.",
                        "You gain the Slippery monster trait.",
                        "You gain the Chamaeleon Skin monster trait."
                    ]
                },
                "Additionally, choose one of the skills gained through your Changeling Instincts racial feature. Your {@variantrule Proficiency|Ishiir} bonus is doubled for any check you make with it."
            ]
        },
        {
            "name": "Dark Arts",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Blood Hunter",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You learn an additional Blood Curse and you gain an additional use of Blood Maledict.",
                        "When you roll your Hemocraft Die to determine the necrotic damage you take for using a feature from this class, you can roll it a second time and take the lower result."
                    ]
                }
            ]
        },
        {
            "name": "Summoner's Bond",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Summoner",
                            "visible": true
                        }
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You gain an additional evolution feat.",
                        "When you are reduced to 0 hit points but not killed outright, your Eidolon can use its reaction to cause you to drop to 1 hit point instead.",
                        "When your Eidolon is reduced to 0 hit points but not killed outright, you can use your reaction to cause it to drop to 1 hit point instead.",
                        "You can't use this feature again until you finish a {@variantrule Long Rest|Ishiir}."
                    ]
                }
            ]
        },
        {
            "name": "Awakened Mind",
            "page": 1,
            "source": "Ishiir",
            "ability": [
                {
                    "choose": {
                        "from": [
                            "int",
                            "wis",
                            "cha"
                        ],
                        "amount": 1
                    }
                }
            ],
            "skillProficiencies": [
                {
                    "any": 1
                }
            ],
            "prerequisite": [
                {
                    "race": [
                        {
                            "name": "awakened forest owl"
                        }
                    ]
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "Choose either WIS, INT, or CHA. Your chosen ability score increases by 1 and your maximum for it increases by 2.",
                        "Additionally, you learn one skill that uses your chosen ability score."
                    ]
                }
            ]
        },
        {
            "name": "Enchanter",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "spellcasting": true
                }
            ],
            "toolProficiencies": [
                {
                    "enchanter's supplies": true
                }
            ],
            "entries": [
                "Your studies of magic have made you particularly adept at creating scrolls and magical items.",
                {
                    "type": "list",
                    "items": [
                        "You gain {@variantrule Proficiency|Ishiir} with the enchanter's supplies. If you are already proficient in these tools, your {@variantrule Proficiency|Ishiir} bonus is doubled for any skill check you make with them.",
                        "If you craft a magical item that has a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold."
                    ]
                }
            ]
        },
        {
            "name": "Martial Excellence",
            "page": 1,
            "source": "Ishiir",
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "class",
                            "visible": true
                        }
                    }
                }
            ],
            "ability": [
                {
                    "choose": {
                        "from": [
                            "str",
                            "dex"
                        ],
                        "amount": 1
                    }
                }
            ],
            "entries": [
                {
                    "type": "list",
                    "items": [
                        "You gain access to the mastery of any armor and weapon you are proficient in, as per the {@classFeature Martial Mastery|Barbarian|Ishiir|4|Ishiir} class feature."
                    ]
                }
            ]
        }
    ]
}