{
    "_meta": {
        "sources": [
            {
                "json": "Ishiir",
                "abbreviation": "Ishiir",
                "full": "Ishiir",
                "url": "https://regateiro.pt/5etools/homebrew/ishiir-actions.json",
                "authors": [
                    "Sieg"
                ],
                "convertedBy": [
                    "Morb"
                ]
            }
        ]
    },
    "action": [
        {
            "name": "Activate an Item",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "Activating some magic items requires a user to do something in particular, such as holding the item and uttering a command word, reading the item if it is a scroll, or drinking it if it is a potion. The description of each item category or individual item details how an item is activated. Certain items use one or more of the following rules related to their activation.",
                "If an item requires an {@variantrule Action|Ishiir} to activate, that action isn't a function of the {@action Use an Object|Ishiir} action, so a feature such as the rogue's {@subclassFeature Fast Hands|Rogue|Ishiir|Thief|Ishiir|3} can't be used to activate the item.",
                {
                    "type": "entries",
                    "name": "Command Word",
                    "entries": [
                        "A command word is a word or phrase that must be spoken audibly for the item to operate. A magic item that requires the user to speak a command word can't be activated in the area of any effect that prevents sound, such as the area created by the silence spell."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Consumables",
                    "entries": [
                        "Some items are used up when they are activated. A potion or elixir must be swallowed, or an oil applied to the body. The writing vanishes from a scroll when it is read. Once used, a consumable item loses its magic and no longer functions."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Spells",
                    "entries": [
                        "Some magic items allow the user to cast a spell from the item, often by expending charges from it. The spell is cast at the lowest possible spell and caster level, doesn't expend any of the user's spell slots, and requires no components unless the item's description says otherwise. The spell uses its normal casting time, range, and duration, and the user of the item must concentrate if the spell requires {@condition Concentration|Ishiir}. Certain items make exceptions to these rules, changing the casting time, duration, or other parts of a spell.",
                        "Many items, such as potions, bypass the casting of the spell and confer the spell's effects. Such an item still uses the spell's duration unless the item's description says otherwise.",
                        "A magic item, such as certain staffs, may require you to use your own spellcasting ability when you cast a spell from the item. If you have more than one spellcasting ability, you choose which one to use with the item. If you don't have a spellcasting ability—perhaps you're a rogue with the Use Magic Device feature—your spellcasting ability modifier is +0 for the item, and your {@variantrule Proficiency|Ishiir} bonus does apply."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Charges",
                    "entries": [
                        "Some magic items have charges that you expend to activate its properties. The number of charges an item has remaining is revealed when an identify spell is cast on the item, or when a creature attunes to the item. Additionally, when an item regains charges, the creature attuned to that item learns how many charges it regained."
                    ]
                }
            ]
        },
        {
            "name": "Attack",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "The most common action to take in combat is the Attack action, whether you are swinging a sword, firing an arrow from a bow, or brawling with your fists.",
                "With this action, you make one melee or ranged attack. See the \"{@book Making an Attack|phb|9|making an attack}\" section for the rules that govern attacks.",
                "Certain features, such as the Extra Attack feature of the fighter, allow you to make more than one attack with this action."
            ],
            "seeAlsoAction": [
                "Disarm|DMG",
                "Grapple",
                "Mark|DMG",
                "Shove",
                "Shove Aside|DMG",
                "Two-Weapon Fighting"
            ]
        },
        {
            "name": "Cast a Spell",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                "Varies"
            ],
            "entries": [
                "Spellcasters such as wizards and clerics, as well as many monsters, have access to spells and can use them to great effect in combat. Each spell has a casting time, which specifies whether the caster must use an {@variantrule Action|Ishiir}, a {@variantrule Reaction|Ishiir}, minutes, or even hours to cast the spell. Casting a spell is, therefore, not necessarily an {@variantrule Action|Ishiir}. Most spells do have a casting time of 1 action, so a spellcaster often uses his or her action in combat to cast such a spell. See {@book chapter 10|phb|10|casting a spell} for the rules on spellcasting."
            ]
        },
        {
            "name": "Climb onto a Bigger Creature",
            "page": 1,
            "source": "Ishiir",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "Make special grappling attempt as an {@variantrule Action|Ishiir} against a creature at least two sizes larger than you. To do so, make a Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check (your choice), contested by the creature's Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check (creature's choice). Unlike with a normal grappling attempt, there is no limitation on the maximum size of your target, but the target still has {@variantrule Advantage|Ishiir} on their skill check for the size difference.",
                "If you succeed, you successfully move into the target creature's space and cling to its body. While in the target's space, you move with the target and have {@variantrule Advantage|Ishiir} on {@variantrule Attack Roll|Ishiir|Attack Rolls} against it.",
                "You can move around within the larger creature's space, treating the space as {@quickref difficult terrain||3}. This movement counts as climbing.",
                "The larger creature's ability to attack you depends on your location, and is left to the DM's discretion. The larger creature can dislodge you as an {@variantrule Action|Ishiir} - knocking you off, scraping you against a wall, or grabbing and throwing you - by making a Strength ({@skill Athletics}) check or Dexterity ({@skill Acrobatics}) contested by your Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check. You choose which check to use."
            ]
        },
        {
            "name": "Dash",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you take the Dash action, you gain extra movement for the current turn. The increase equals your {@variantrule Speed|Ishiir}, after applying any modifiers. With a {@variantrule Speed|Ishiir} of 30 feet, for example, you can move up to 60 feet on your turn if you dash.",
                "Any increase or decrease to your {@variantrule Speed|Ishiir} changes this additional movement by the same amount. If your {@variantrule Speed|Ishiir} of 30 feet is reduced to 15 feet, for instance, you can move up to 30 feet this turn if you dash."
            ]
        },
        {
            "name": "Disarm",
            "page": 1,
            "source": "Ishiir",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you take the attack action, you can replace any of your attacks with an attempt to knock a weapon or another item from the grasp of a target that is no more than one size larger than you. Make an {@variantrule Attack Roll|Ishiir} contested by the target's Strength ({@skill Athletics}) check or Dexterity ({@skill Acrobatics}) check. If you win the contest, the attack causes no damage or other ill effect, but the defender drops the item.",
                "You have {@variantrule Disadvantage|Ishiir} on your {@variantrule Attack Roll|Ishiir} if the target is holding the item with two or more hands or if the item is otherwise additionally secured (e.g. the strap on a shield). The target has {@variantrule Advantage|Ishiir} on its {@variantrule Ability Check|Ishiir} if it is larger than the attacking creature, or {@variantrule Disadvantage|Ishiir} if it is smaller."
            ]
        },
        {
            "name": "Disengage",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "If you take the Disengage action, your movement doesn't provoke opportunity attacks for the rest of the turn."
            ]
        },
        {
            "name": "Dodge",
            "page": 1,
            "source": "Ishiir",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any {@variantrule Attack Roll|Ishiir} or attempts to {@action grapple|Ishiir} made against you has {@variantrule Disadvantage|Ishiir} if you can see the attacker, and you make Dexterity {@variantrule Saving Throw|Ishiir|Saving Throws} with {@variantrule Advantage|Ishiir}. You lose this benefit if you are incapacitated (as explained in the appendix) or if your {@variantrule Speed|Ishiir} drops to 0."
            ]
        },
        {
            "name": "Don or Doff a Shield",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "The time it takes to don or doff armor {@table Getting Into and Out of Armor; Donning and Doffing Armor|phb|depends on the armor's category}. A {@item shield|phb} can be donned or doffed as an {@variantrule Action|Ishiir}."
            ]
        },
        {
            "name": "End Concentration",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                "Free"
            ],
            "entries": [
                "If a spell must be maintained with {@condition Concentration|Ishiir}, that fact appears in its Duration entry, and the spell specifies how long you can concentrate on it. You can end {@condition Concentration|Ishiir} at any time (no action required)."
            ]
        },
        {
            "name": "Escape a Grapple",
            "source": "Ishiir",
            "page": 1,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "A {@condition Grappled|Ishiir} creature can use its action to escape. To do so, it must succeed on a Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check contested by your Strength ({@skill Athletics}) check."
            ],
            "seeAlsoAction": [
                "Grapple"
            ]
        },
        {
            "name": "Goad",
            "page": 1,
            "source": "Ishiir",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you take the attack action, you can replace any of your attacks with an attempt to keep the target creature's attention and goad it into attacking you.",
                "To do so make a Charisma ({@skill Deception}), Charisma ({@skill Intimidation}), or Charisma ({@skill Performance}) check, contested by the targets Wisdom (Insight). If you succeed, the target creature has {@variantrule Disadvantage|Ishiir} on {@variantrule Attack Roll|Ishiir|Attack Rolls} against anyone other than you until the start of your next turn."
            ]
        },
        {
            "name": "Grapple",
            "source": "Ishiir",
            "page": 1,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you want to grab a creature or wrestle with it, you can use the {@action Attack|Ishiir} action to make a special melee attack, a grapple. If you're able to make multiple attacks with the {@action Attack|Ishiir} action, this attack replaces one of them. The target of your grapple must be no more than one size larger than you, and it must be within your reach.",
                "Using at least one free hand, you try to seize the target by making a grapple check, a Strength ({@skill Athletics}) check contested by the target's Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check (the target chooses the ability to use). You succeed automatically if the target is {@condition Incapacitated|Ishiir}. If you succeed, you subject the target to the {@condition Grappled|Ishiir} condition (see the appendix). The condition specifies the things that end it, and you can release the target whenever you like (no action required).",
                {
                    "type": "entries",
                    "name": "Moving a Grappled Target",
                    "entries": [
                        "When you move, you can drag or carry the {@condition Grappled|Ishiir} creature with you, but your {@variantrule Speed|Ishiir} is halved, unless the creature is two or more sizes smaller than you."
                    ]
                }
            ],
            "seeAlsoAction": [
                "Escape a Grapple|Ishiir"
            ]
        },
        {
            "name": "Help",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "You can lend your aid to another creature in the completion of a task. When you take the Help action, the creature you aid gains {@variantrule Advantage|Ishiir} on the next {@variantrule Ability Check|Ishiir} it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn.",
                "Alternatively, you can aid a friendly creature in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your ally's attack more effective. If your ally attacks the target before your next turn, the first {@variantrule Attack Roll|Ishiir} is made with {@variantrule Advantage|Ishiir}."
            ]
        },
        {
            "name": "Hide",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you take the Hide action, you make a Dexterity ({@skill Stealth}) check in an attempt to hide, following the rules in {@book chapter 7 |phb|7|hiding} for hiding. If you succeed, you gain certain benefits, as described in the \"{@book Unseen Attackers and Targets|PHB|9|unseen attackers and targets}\" section in the Player's Handbook."
            ]
        },
        {
            "name": "Identify a Spell",
            "source": "Ishiir",
            "page": 1,
            "fromVariant": "Spellcasting|XGE",
            "time": [
                {
                    "number": 1,
                    "unit": "reaction"
                },
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "Sometimes a character wants to identify a spell that someone else is casting or that was already cast. To do so, a character can use their {@variantrule Reaction|Ishiir} to identify a spell as it's being cast, or they can use an {@variantrule Action|Ishiir} on their turn to identify a spell by its effect after it is cast.",
                "If the character perceived the casting, the spell's effect, or both, the character can make an Intelligence ({@skill Arcana}) check with the {@variantrule Reaction|Ishiir} or action. The DC equals 15 + the spell's level. If the spell is cast as a class spell and the character is a member of that class, the check is made with {@variantrule Advantage|Ishiir}. For example, if the spellcaster casts a spell as a cleric, another cleric has {@variantrule Advantage|Ishiir} on the check to identify the spell. Some spells aren't associated with any class when they're cast, such as when a monster uses its Innate Spellcasting trait.",
                "This Intelligence ({@skill Arcana}) check represents the fact that identifying a spell requires a quick mind and familiarity with the theory and practice of casting. This is true even for a character whose spellcasting ability is Wisdom or Charisma. Being able to cast spells doesn't by itself make you adept at deducing exactly what others are doing when they cast their spells."
            ]
        },
        {
            "name": "Improvising an Action",
            "source": "Ishiir",
            "page": 1,
            "basicRules": true,
            "time": [
                "Varies"
            ],
            "entries": [
                "Your character can do things not covered by the actions in this chapter, such as breaking down doors, intimidating enemies, sensing weaknesses in magical defenses, or calling for a parley with a foe. The only limits to the actions you can attempt are your imagination and your character's ability scores. See the descriptions of the ability scores in {@book chapter 7|phb|7|Ability Scores and Modifiers} for inspiration as you improvise.",
                "When you describe an {@variantrule Action|Ishiir} not detailed elsewhere in the rules, the DM tells you whether that action is possible and what kind of roll you need to make, if any, to determine success or failure."
            ]
        },
        {
            "name": "Magic",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you take the Magic action, you cast a spell that has a casting time of an {@variantrule Action|Ishiir} or use a feature or magic item that requires a Magic action to be activated.",
                "If you cast a spell that has a casting time of 1 minute or longer, you must take the Magic action on each turn of that casting, and you must maintain {@condition Concentration|Ishiir} while you do so. If your {@condition Concentration|Ishiir} is broken, the spell fails, but you don't expend a spell slot."
            ]
        },
        {
            "name": "Mark",
            "source": "Ishiir",
            "page": 1,
            "entries": [
                "This option makes it easier for melee combatants to harry each other with opportunity attacks.",
                "When a creature makes a melee attack, it can also mark its target. Until the end of the attacker's next turn, any opportunity attack it makes against the marked target has {@variantrule Advantage|Ishiir}. The opportunity attack doesn't expend the attacker's {@variantrule Reaction|Ishiir}, but the attacker can't make the attack if anything, such as the {@condition Incapacitated|Ishiir} condition or the {@spell shocking grasp|Ishiir} spell, is preventing it from taking {@variantrule Reaction|Ishiir|Reactions}. The attacker is limited to one opportunity attack per turn."
            ],
            "seeAlsoAction": [
                "Attack"
            ]
        },
        {
            "name": "Opportunity Attack",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "reaction"
                }
            ],
            "entries": [
                "In a fight, everyone is constantly watching for enemies to drop their guard. You can rarely move heedlessly past your foes without putting yourself in danger; doing so provokes an opportunity attack.",
                "You can make an opportunity attack when a hostile creature that you can see moves out of your reach. To make the opportunity attack, you use your {@variantrule Reaction|Ishiir} to make one melee attack against the provoking creature. The attack interrupts the provoking creature's movement, occurring right before the creature leaves your reach.",
                "You can avoid provoking an opportunity attack by taking the {@action Disengage|Ishiir} action. You also don't provoke an opportunity attack when you teleport or when someone or something moves you without using your movement, action, or {@variantrule Reaction|Ishiir}. For example, you don't provoke an opportunity attack if an explosion hurls you out of a foe's reach or if gravity causes you to fall past an enemy."
            ]
        },
        {
            "name": "Other Activity",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                "Varies"
            ],
            "entries": [
                "Your turn can include a variety of flourishes that require neither your action nor your move.",
                "You can communicate however you are able, through brief utterances and gestures, as you take your turn.",
                "You can also interact with one object or feature of the environment for free, during either your move or your action. For example, you could open a door during your move as you stride toward a foe, or you could draw your weapon as part of the same action you use to attack.",
                "If you want to interact with a second object, you need to use your action. Some magic items and other special objects always require an {@variantrule Action|Ishiir} to use, as stated in their descriptions.",
                "The DM might require you to use an {@variantrule Action|Ishiir} for any of these activities when it needs special care or when it presents an unusual obstacle. For instance, the DM could reasonably expect you to use an {@variantrule Action|Ishiir} to open a stuck door or turn a crank to lower a drawbridge.",
                {
                    "type": "inset",
                    "name": "Interacting with Objects Around You",
                    "entries": [
                        "Here are a few examples of the sorts of thing you can do in tandem with your movement and action:",
                        {
                            "type": "list",
                            "items": [
                                "draw or sheathe a sword",
                                "open or close a door",
                                "withdraw a potion from your backpack",
                                "pick up a dropped axe",
                                "take a bauble from a table",
                                "remove a ring from your finger",
                                "stuff some food into your mouth",
                                "plant a banner in the ground",
                                "fish a few coins from your belt pouch",
                                "drink all the ale in a flagon",
                                "throw a lever or a switch",
                                "pull a torch from a sconce",
                                "take a book from a shelf you can reach",
                                "extinguish a small flame",
                                "don a mask",
                                "pull the hood of your cloak up and over your head",
                                "put your ear to a door",
                                "kick a small stone",
                                "turn a key in a lock",
                                "tap the floor with a 10-foot pole",
                                "hand an item to another character"
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Overrun",
            "page": 1,
            "source": "Ishiir",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                },
                {
                    "number": 1,
                    "unit": "bonus"
                }
            ],
            "entries": [
                "You can try to force your way through a hostile creature's square, by pushing it aside or bullrushing through. Make a Strength ({@skill Athletics}) check contested by the hostile creature's Strength ({@skill Athletics}) check.",
                "You have {@variantrule Advantage|Ishiir} on this check if you are larger than the hostile creature, or {@variantrule Disadvantage|Ishiir} if you are smaller. If you win the contest, you can move through the hostile creature's space once this turn, treating its space as normal terrain."
            ]
        },
        {
            "name": "Ready",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "Sometimes you want to get the jump on a foe or wait for a particular circumstance before you act. To do so, you can take the Ready action on your turn, which lets you act using your {@variantrule Reaction|Ishiir} before the start of your next turn.",
                "First, you decide what perceivable circumstance will trigger your {@variantrule Reaction|Ishiir}. Then, you choose the action you will take in response to that trigger, or you choose to move up to your {@variantrule Speed|Ishiir} antrule Speed|Ishiir} in response to it. Examples include \"If the cultist steps on the trapdoor, I'll pull the lever that opens it,\" and \"If the goblin steps next to me, I move away.\"",
                "When the trigger occurs, you can either take your {@variantrule Reaction|Ishiir} right after the trigger finishes or ignore the trigger. Remember that you can take only one {@variantrule Reaction|Ishiir} per round.",
                "When you ready a spell, you cast it as normal but hold its energy, which you release with your {@variantrule Reaction|Ishiir} when the trigger occurs. To be readied, a spell must have a casting time of 1 action, and holding onto the spell's magic requires {@condition Concentration|Ishiir}. If your {@condition Concentration|Ishiir} is broken, the spell dissipates without taking effect. For example, if you are concentrating on the web spell and ready magic missile, your web spell ends, and if you take damage before you release magic missile with your {@variantrule Reaction|Ishiir}, your {@condition Concentration|Ishiir} might be broken.",
                "You have until the start of your next turn to use a readied action."
            ]
        },
        {
            "name": "Search",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you take the Search action, you devote your attention to finding something. Depending on the nature of your search, the DM might have you make a Wisdom ({@skill Perception}) check or an Intelligence ({@skill Investigation}) check."
            ]
        },
        {
            "name": "Shove",
            "source": "Ishiir",
            "page": 1,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "Using the {@action Attack|Ishiir} action, you can make a special melee attack to shove a creature, either to knock it {@condition Prone|Ishiir} or push it away from you. If you're able to make multiple attacks with the {@action Attack|Ishiir} action, this attack replaces one of them.",
                "The target of your shove must be no more than one size larger than you, and it must be within your reach. You make a Strength ({@skill Athletics}) check contested by the target's Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check (the target chooses the ability to use). You succeed automatically if the target is {@condition Incapacitated|Ishiir}. If you succeed, you either knock the target {@condition Prone|Ishiir} or push it 5 feet away from you."
            ],
            "seeAlsoAction": [
                "Attack",
                "Shove Aside|DMG"
            ]
        },
        {
            "name": "Shove Aside",
            "source": "Ishiir",
            "page": 1,
            "fromVariant": "Action Options",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "With this option, a creature uses the special {@action shove|Ishiir} attack from the {@book Player's Handbook|PHB|9|Shoving a Creature} to force a target to the side, rather than away. The attacker has {@variantrule Disadvantage|Ishiir} on its Strength ({@skill Athletics}) check when it does so. If that check is successful, the attacker moves the target 5 feet to a different space within its reach."
            ]
        },
        {
            "name": "Stagger",
            "page": 1,
            "source": "Ishiir",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "When you take the attack action, you can replace any of your attacks with an attempt to knock a target no more than one size larger than you off-balance and dull its reaction speed. Make an {@variantrule Attack Roll|Ishiir} contested by the target's Strength ({@skill Athletics}) check or Dexterity ({@skill Acrobatics}) check. If you win the contest, the attack causes no damage or other ill effect, but the defender cannot take {@variantrule Reaction|Ishiir|Reactions} until the start of your next turn.",
                "The target has {@variantrule Advantage|Ishiir} on its {@variantrule Ability Check|Ishiir} if it is larger than you, or {@variantrule Disadvantage|Ishiir} if it is smaller."
            ]
        },
        {
            "name": "Tumble",
            "page": 1,
            "source": "Ishiir",
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                },
                {
                    "number": 1,
                    "unit": "bonus"
                }
            ],
            "entries": [
                "You can try to tumble through a hostile creature's space, ducking and weaving past the opponent. Make a Dexterity ({@skill Acrobatics}) check contested by the hostile creature's Dexterity ({@skill Acrobatics}) check. If you win the contest, you can move through the hostile creature's space once this turn, treating its space as {@quickref difficult terrain||3}."
            ]
        },
        {
            "name": "Two-Weapon Fighting",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "bonus"
                }
            ],
            "entries": [
                "When you take the {@action Attack|Ishiir} action and attack with a light melee weapon that you're holding in one hand, you can use a {@variantrule Bonus Action|Ishiir} to attack with a different light melee weapon that you're holding in the other hand. You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative.",
                "If either weapon has the thrown property, you can throw the weapon, instead of making a melee attack with it."
            ],
            "seeAlsoAction": [
                "Attack"
            ]
        },
        {
            "name": "Use an Object",
            "source": "Ishiir",
            "page": 1,
            "srd": true,
            "basicRules": true,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "You normally interact with an object while doing something else, such as when you draw a sword as part of an attack. When an object requires your action for its use, you take the Use an Object action. This action is also useful when you want to interact with more than one object on your turn."
            ]
        },
        {
            "name": "Waking Someone",
            "source": "Ishiir",
            "page": 1,
            "time": [
                {
                    "number": 1,
                    "unit": "action"
                }
            ],
            "entries": [
                "A creature that is naturally sleeping, as opposed to being in a magically or chemically induced sleep, wakes up if it takes any damage or if someone else uses an {@variantrule Action|Ishiir} to shake or slap the creature awake. A sudden loud noise—such as yelling, thunder, or a ringing bell—also awakens someone that is sleeping naturally.",
                "Whispers don't disturb sleep, unless a sleeper's passive Wisdom ({@skill Perception}) score is 20 or higher and the whispers are within 10 feet of the sleeper. Speech at a normal volume awakens a sleeper if the environment is otherwise silent (no wind, birdsong, crickets, street sounds, or the like) and the sleeper has a passive Wisdom ({@skill Perception}) score of 15 or higher."
            ]
        }
    ]
}